{
	"start_game": "НАЧАЛО",
	"leaderboard": "РЕЙТИНГ",
	"how_to_play_title": "КАК ДА ИГРАЕТЕ?",
	"contact_title": "КОНТАКТИ",
	"game_settings": "НАСТРОЙКИ НА ИГРАТА",
	"game_difficulty": "Трудност",
	"game_difficulty_normal": "Нормален",
	"game_difficulty_hard": "Труден",
	"game_number_of_fault": "Брой грешки",
	"game_options_amount": "Опции",
	"spent_time": "Прекарано време",
	"laps_amount": "Брой обиколки",
	"play_again": "ИГРАЙ ОТНОВО",
	"save": "ЗАПАЗИ",
	"send": "ИЗПРАТИ",
	"save_score": "ЗАПАЗИ РЕЗУЛТАТ",
	"score_owner": "Собственик на резултат",
	"email_address": "Имейл адрес",
	"message": "Вашето съобщение",
	"go_back": "ВРЪЩАНЕ",
	"be_ready": "БЪДЕТЕ ГОТОВИ",
	"hard": "ТРУДЕН",
	"full_screen_mode_title": "Режим на цял екран",
	"full_screen_mode_desc": "Препоръчва се за по-добро игрово изживяване",
	"no_record": "Няма записи тук",
	"global": "ГЛОБАЛЕН",
	"points": "{points} точки",
	"multiplier": "{multiplier} множител",
	"lap": "{lap} обиколка",
	"game_ended": "ИГРАТА ЗАВЪРШИ",
	"privacy_policy_title": "Политика за конфиденциалност",
	"cookie_policy_title": "Политика за бисквитки",
	"terms_of_use_title": "Условия за ползване",
	"gdpr_title": "Текст на GDPR",
	"main_title": "Пъзел с флагове",
	"main_description": "Открийте знамена с нива на трудност, изберете правилния отговор и заемете своето място в класацията! Забавната и конкурентна игра с викторина за знамена ви очаква!",
	"multiplier_title": "Коэффициент на множител:",
	"lives_are_over": "ЖИВОТИТЕ ВИ СА ИЗЧЕРПАНИ",
	"return_the_game": "Върнете се в играта с кратка рекламна пауза!",
	"watch_ad": "ГЛЕДАЙТЕ РЕКЛАМА",
	"end_game": "КРАЙ НА ИГРАТА",
	"hours": "часове",
	"minutes": "минути",
	"seconds": "секунди",
	"sound_on": "Звукът е включен",
	"sound_off": "Звукът е изключен",
	"score_saved_successfully": "Резултатът беше успешно запазен",
	"message_sent_successfully": "Вашето съобщение беше изпратено успешно",
	"invalid_owner": "Невалидна информация за притежателя на резултата",
	"invalid_email": "Невалиден имейл адрес",
	"occured_an_error": "Възникна грешка",
	"how_to_play": "<h4><span class=\"title-square\"></span>Цел на играта:</h4><p>Тествайте познанията си за флагове и се опитайте да постигнете най-високия резултат! Правилно познайте страната на флаговете, които виждате в играта и поставете името си в класацията!</p><br><h4><span class=\"title-square\"></span>Започване на играта:</h4><p>Изберете „Започнете игра“ от главното меню.</p><br><h6><span class=\"title-square\"></span>Настройте настройките на играта:</h6><p><b>Трудност:</b> Нормална или Трудна<br><b>Брой грешки:</b> 1, 3 или 5<br><b>Брой опции:</b> 2, 4 или 6<br><b>Режим на цял екран:</b> Включен или Изключен</p><br><h6><span class=\"title-square\"></span>Когато започне играта:</h6><p>Горен ляв ъгъл: Текущ резултат и множител<br>Горен център: Обратно броене от 10 секунди<br>Горен десен ъгъл: Брой грешки (икона на сърце)<br>Бутон за изключване/включване на звука</p><br><h4><span class=\"title-square\"></span>Система за оценяване:</h4><p>Точките варират в зависимост от настройките, избрани в началото на играта:</p><br><p><b>Трудност:</b> Нормална (x1.00), Трудна (x1.50)<br><b>Брой грешки:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Брой опции:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>По подразбиране множител за всяка рунда:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Как да спечелите играта:</h4><p>Ако дадете грешен отговор, броят на грешките ви намалява.<br>Ако времето изтече, играта приключва.<br>В края на играта можете да видите вашата статистика и резултат.<br>Можете да запишете своя резултат, за да влезете в класацията.</p>",
	"cookie_policy": "<h2><span>ПОЛИТИКА ЗА БИСКВИТКИ</span></h2><br><h4><span class=\"title-square\"></span>Какво са бисквитките?</h4><p>Тази игра използва бисквитки, за да подобри потребителското изживяване. Бисквитките са малки текстови файлове, които се съхраняват на вашето устройство и се използват за запомняне на настройките на играта.</p><br><h4><span class=\"title-square\"></span>Какви бисквитки използваме?</h4><h6><span class=\"title-square\"></span>Основни бисквитки:</h6><p>Използваме localStorage за запазване на настройките на звука в играта.</p><h6><span class=\"title-square\"></span>Аналитични бисквитки:</h6><p>Използваме Google Analytics, за да анализираме как се играе играта и кои секции са по-популярни.</p><h6><span class=\"title-square\"></span>Рекламни бисквитки:</h6><p>Ако използваме Google AdSense в играта, бисквитките може да се използват за показване на персонализирани реклами от Google.</p><br><h4><span class=\"title-square\"></span>Мога ли да изключа бисквитките?</h4><p>Можете да изтриете или блокирате бисквитки от настройките на браузъра си. Въпреки това, някои функции може да не работят правилно.</p>",
	"privacy_policy": "<h2><span>ПОЛИТИКА ЗА ПОВЕРИТЕЛНОСТ</span></h2><br><h4><span class=\"title-square\"></span>Какви данни събираме?</h4><p>Имената на играчите и резултатите се съхраняват в класацията.<br>Записваме вашите предпочитания в играта (звук включен/изключен и т.н.) в браузъра ви.<br>Анализираме представянето на играта чрез Google Analytics.</p><br><h4><span class=\"title-square\"></span>Как се използват данните?</h4><p>За подобряване на преживяването на играчите<br>За създаване на класацията<br>За анализ на представянето на играта</p><br><h4><span class=\"title-square\"></span>Споделяме ли данни?</h4><p>Вашите лични данни не се споделят с трети страни.<br>Въпреки това, тъй като използваме Google Analytics, може да се прилагат политиките за бисквитки на Google.</p><br><h4><span class=\"title-square\"></span>Сигурност на данните</h4><p>Не се събират лични данни, освен имената на играчите и резултатите.<br>Данните се съхраняват и защитават в криптирани бази данни.</p>",
	"terms_of_use": "<h2><span>УСЛОВИЯ ЗА ПОЛЗВАНЕ</span></h2><br><h4><span class=\"title-square\"></span>1. Използване на услугата</h4><p>Тази игра е отворена за всички и е безплатна за играене.<br>Чрез играене на играта, вие се съгласявате с условията, посочени тук.</p><br><h4><span class=\"title-square\"></span>2. Регистрация на акаунт и резултати</h4><p>Играчите трябва да въведат име, за да запишат резултатите си.<br>Въведените имена са видими за всички.<br>Играчите не могат да използват обидни, неприлични или незаконни имена по време на играта.</p><br><h4><span class=\"title-square\"></span>3. Права върху интелектуалната собственост</h4><p>Съдържанието на играта (флагове, графика, механика) подлежи на авторски права.</p><br><h4><span class=\"title-square\"></span>4. Санкции и прекратяване</h4><p>Ако играта се злоупотребява или се открие измама, резултатите на потребителите могат да бъдат изтрити.</p>",
	"gdpr": "<h2><span>ЗАЩИТА НА ЛИЧНИТЕ ДАННИ И ПОЛИТИКА ЗА ПОВЕРИТЕЛНОСТ</span></h2><br><p>Текстът на това разкритие е подготвен в съответствие със Закона за защита на личните данни № 6698 (ЗЗЛД) и Общия регламент за защита на данните на Европейския съюз (GDPR). По-долу можете да намерите информация за това какви лични данни събираме, докато играете нашата игра, как ги обработваме и как ги защитаваме.</p><br><h4><span class=\"title-square\"></span>1. Кой е контролер на данни?</h4><p>Тази игра се управлява от xuibo. Ако желаете да се свържете с нас относно защитата на вашите лични данни, можете да ни потърсите на <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Какви лични данни обработваме?</h4><p>Ние не събираме директно идентификационни данни, докато играете нашата игра. Въпреки това, може да обработваме следните данни:</p><br><h6><span class=\"title-square\"></span>Задължителни данни (необходими за игровото изживяване)</h6><p>Име на играча (Показано в класацията)<br>Игрови статистики (Резултат, брой правилни/неправилни отговори и т.н.)<br>Настройки за звук и визуализация (Съхранява се с помощта на LocalStorage в браузъра)</p><br><h6><span class=\"title-square\"></span>Автоматично събирани данни</h6><p>IP адрес и информация за устройството (Събира се анонимно чрез Google Analytics)<br>Информация за браузъра и операционната система<br>Данни за използването на играта (Брой отговорени въпроси, продължителност на играта и т.н.)</p><br><h6><span class=\"title-square\"></span>Бисквитки и технологии за проследяване</h6><p>Нашата игра може да използва бисквитки за събиране на анонимни данни чрез Google Analytics и подобни инструменти. За повече подробности, моля, проверете нашата <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Политика за бисквитки</a>.</p><br><h4><span class=\"title-square\"></span>3. Цели на обработка на лични данни</h4><p>Осигуряване на правилното функциониране на играта<br>Създаване на класацията и показване на резултатите на играчите<br>Персонализиране на игровото изживяване (Mute звук, предпочитания за пълен екран и т.н.)<br>Анализиране и подобряване на представянето на играта<br>Сигурност, отстраняване на грешки и предотвратяване на измами<br>Спазване на законови задължения</p><br><h4><span class=\"title-square\"></span>4. С кого споделяме лични данни?</h4><p>Имената на играчите и резултатите в класацията могат да бъдат публично показвани.<br>Анонимни данни се анализират чрез Google Analytics, но не се споделят лични данни.<br>Данни могат да бъдат споделяни с упълномощени органи по правни искания.</p><br><h4><span class=\"title-square\"></span>5. Правно основание за обработка на лични данни</h4><p>Вашите данни се обработват в съответствие със ЗЗЛД и GDPR на базата на следните правни основания:<br><br>Изпълнение на договор (ЗЗЛД чл.5/2-в, GDPR чл.6/1-б) → Осигуряване на правилното функциониране на играта<br>Легитимен интерес (ЗЗЛД чл.5/2-ю, GDPR чл.6/1-ф) → Анализиране и подобряване на игровото изживяване<br>Законни задължения (ЗЗЛД чл.5/2-ю, GDPR чл.6/1-в) → Отговор на официални искания от органи</p><br><h4><span class=\"title-square\"></span>6. Как дълго съхраняваме вашите данни?</h4><p>Имената на играчите и резултатите в класацията могат да бъдат съхранявани неограничено време. Въпреки това, играчите могат да поискат изтриването на данните си.<br>Данните от Google Analytics са анонимизирани и автоматично изтрити след определен период.<br>Настройки в браузъра (LocalStorage) се съхраняват до затварянето на браузъра или докато потребителят не ги изтрие ръчно.</p><br><h4><span class=\"title-square\"></span>7. Вашите права съгласно ЗЗЛД и GDPR</h4><p>Съгласно ЗЗЛД и GDPR, вие имате следните права:<br><br>- Да разберете дали вашите данни се обработват<br>- Да разберете целта на обработката и как се използват<br>- Да поискате коригиране на неправилно или непълно обработени данни<br>- Да поискате изтриване или анонимизиране на вашите данни<br>- Да бъдете информирани ако вашите обработвани данни се споделят с трети страни<br>- Да поискате компенсация ако обработката е незаконна и води до щети</p><br><p>За да упражните тези права, можете да се свържете с нас на <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Допълнителни права на GDPR (За потребители от ЕС)</h4><p>- Право на преносимост на данни: Ако поискате, ние можем да прехвърлим вашите данни към вас или друг доставчик на услуги.<br>- Право на възражение срещу автоматизирано вземане на решения: Можете да възразите срещу оценката на вашите данни чрез автоматизирани системи.<br>- Право на оттегляне на съгласие: Ако вашите данни се обработват въз основа на вашето съгласие, можете да го оттеглите по всяко време.</p><br><h4><span class=\"title-square\"></span>9. Политика за бисквитки и опции за съгласие</h4><p>Нашата игра използва бисквитки за подобряване на игровото изживяване. В съответствие със законодателството на GDPR, може да се изисква вашето съгласие за използването на бисквитки. Ако искате да деактивирате бисквитките, можете да го направите в настройките на браузъра си.</p><br><p>За повече подробности, моля, посетете нашата <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Политика за бисквитки</a> страница.</p><br><h4><span class=\"title-square\"></span>10. Актуализации и промени</h4><p>Тази политика за поверителност може да бъде актуализирана от време на време. Ние ще ви уведомим за значителни промени чрез нашия уебсайт или в самата игра.</p><br><p>Последна актуализация: 17.03.2025</p>"
}
