{
	"start_game": "STARTEN",
	"leaderboard": "BESTENLISTE",
	"how_to_play_title": "WIE SPIELT MAN?",
	"contact_title": "KONTAKT",
	"game_settings": "SPIELEINSTELLUNGEN",
	"game_difficulty": "Schwierigkeitsgrad",
	"game_difficulty_normal": "Normal",
	"game_difficulty_hard": "Schwierig",
	"game_number_of_fault": "Fehleranzahl",
	"game_options_amount": "Optionen",
	"spent_time": "Verstrichene Zeit",
	"laps_amount": "Rundenanzahl",
	"play_again": "NOCH EINMAL SPIELEN",
	"save": "SPEICHERN",
	"send": "SENDEN",
	"save_score": "PUNKTZAHL SPEICHERN",
	"score_owner": "Punktzahlinhaber",
	"email_address": "E-Mail-Adresse",
	"message": "Ihre Nachricht",
	"go_back": "ZURÜCK",
	"be_ready": "SEI BEREIT",
	"hard": "SCHWIERIG",
	"full_screen_mode_title": "Vollbildmodus",
	"full_screen_mode_desc": "Empfohlen für ein besseres Spielerlebnis",
	"no_record": "Keine Aufzeichnungen hier",
	"global": "GLOBAL",
	"points": "{points} Punkte",
	"multiplier": "{multiplier} Multiplikator",
	"lap": "{lap} Runde",
	"game_ended": "SPIEL BEENDEN",
	"privacy_policy_title": "Datenschutzrichtlinie",
	"cookie_policy_title": "Cookie-Richtlinie",
	"terms_of_use_title": "Nutzungsbedingungen",
	"gdpr_title": "DSGVO Text",
	"main_title": "Flaggenrätsel",
	"main_description": "Entdecke Flaggen mit verschiedenen Schwierigkeitsgraden, wähle die richtige Antwort und erlange deinen Platz in der Bestenliste! Ein spaßiges und wettbewerbsfähiges Flaggenrätsel-Spiel wartet auf dich!",
	"multiplier_title": "Faktor-Koeffizient:",
	"lives_are_over": "DEINE LEBEN SIND AUFGEBRAUCHT",
	"return_the_game": "Kehre mit einer kurzen Werbeunterbrechung ins Spiel zurück!",
	"watch_ad": "WERBUNG ANSEHEN",
	"end_game": "SPIEL BEENDEN",
	"hours": "Stunden",
	"minutes": "Minuten",
	"seconds": "Sekunden",
	"sound_on": "Ton an",
	"sound_off": "Ton aus",
	"score_saved_successfully": "Punktestand erfolgreich gespeichert",
	"message_sent_successfully": "Ihre Nachricht wurde erfolgreich gesendet",
	"invalid_owner": "Ungültige Punktestandbesitzer-Informationen",
	"invalid_email": "Ungültige E-Mail-Adresse",
	"occured_an_error": "Es ist ein Fehler aufgetreten",
	"how_to_play": "<h4><span class=\"title-square\"></span>Spielziel:</h4><p>Teste dein Wissen über Flaggen und versuche, die höchste Punktzahl zu erreichen! Errate korrekt das Land der Flaggen, die du im Spiel siehst, und lass deinen Namen auf der Bestenliste erscheinen!</p><br><h4><span class=\"title-square\"></span>Spielstart:</h4><p>Wähle „Spiel starten“ im Hauptmenü.</p><br><h6><span class=\"title-square\"></span>Stelle die Spieleinstellungen ein:</h6><p><b>Schwierigkeitsgrad:</b> Normal oder Schwierig<br><b>Fehleranzahl:</b> 1, 3 oder 5<br><b>Optionenanzahl:</b> 2, 4 oder 6<br><b>Vollbildmodus:</b> Ein oder Aus</p><br><h6><span class=\"title-square\"></span>Wenn das Spiel startet:</h6><p>Oben links: Aktueller Punktestand und Multiplikator<br>Oben Mitte: 10-Sekunden Countdown<br>Oben rechts: Anzahl der Fehler (Herz-Symbol)<br>Stummschalt-/Lautstärketaste</p><br><h4><span class=\"title-square\"></span>Punktesystem:</h4><p>Punkte variieren je nach den beim Spielstart ausgewählten Einstellungen:</p><br><p><b>Schwierigkeitsgrad:</b> Normal (x1.00), Schwierig (x1.50)<br><b>Fehleranzahl:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Optionenanzahl:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Standard-Multiplikator pro Runde:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Wie man das Spiel gewinnt:</h4><p>Wenn du eine falsche Antwort gibst, sinkt deine Fehleranzahl.<br>Wenn die Zeit abläuft, endet das Spiel.<br>Am Ende des Spiels kannst du deine Statistiken und Punktzahl sehen.<br>Du kannst deine Punktzahl speichern, um auf der Bestenliste zu erscheinen.</p>",
	"cookie_policy": "<h2><span>COOKIE-RICHTLINIE</span></h2><br><h4><span class=\"title-square\"></span>Was sind Cookies?</h4><p>Dieses Spiel verwendet Cookies, um das Benutzererlebnis zu verbessern. Cookies sind kleine Textdateien, die auf deinem Gerät gespeichert werden und dazu verwendet werden, deine Spieleinstellungen zu merken.</p><br><h4><span class=\"title-square\"></span>Welche Cookies verwenden wir?</h4><h6><span class=\"title-square\"></span>Notwendige Cookies:</h6><p>Wir verwenden localStorage, um die Soundeinstellungen des Spiels zu speichern.</p><h6><span class=\"title-square\"></span>Analyse-Cookies:</h6><p>Wir verwenden Google Analytics, um zu analysieren, wie das Spiel gespielt wird und welche Bereiche beliebter sind.</p><h6><span class=\"title-square\"></span>Werbe-Cookies:</h6><p>Wenn wir Google AdSense im Spiel verwenden, können Cookies verwendet werden, um personalisierte Werbung von Google anzuzeigen.</p><br><h4><span class=\"title-square\"></span>Kann ich Cookies deaktivieren?</h4><p>Du kannst Cookies in den Einstellungen deines Browsers löschen oder blockieren. Einige Funktionen funktionieren jedoch möglicherweise nicht richtig.</p>",
	"privacy_policy": "<h2><span>DATENSCHUTZRICHTLINIE</span></h2><br><h4><span class=\"title-square\"></span>Welche Daten Sammeln Wir?</h4><p>Spielernamen und Punktzahlen werden in der Rangliste gespeichert.<br>Wir speichern deine In-Game-Einstellungen (Ton ein/aus, etc.) in deinem Browser.<br>Wir analysieren die Spielperformance mit Google Analytics.</p><br><h4><span class=\"title-square\"></span>Wie Wird Das Daten Genutzt?</h4><p>Um das Spielerlebnis zu verbessern<br>Um die Rangliste zu erstellen<br>Um die Spielperformance zu analysieren</p><br><h4><span class=\"title-square\"></span>Teilen Wir Daten?</h4><p>Deine persönlichen Daten werden nicht an Dritte weitergegeben.<br>Da wir Google Analytics verwenden, gelten möglicherweise die Cookie-Richtlinien von Google.</p><br><h4><span class=\"title-square\"></span>Daten Sicherheit</h4><p>Es werden keine persönlichen Daten außer Spielernamen und Punktzahlen gesammelt.<br>Die Daten werden in verschlüsselten Datenbanken gespeichert und geschützt.</p>",
	"terms_of_use": "<h2><span>NUTZUNGSBEDINGUNGEN</span></h2><br><h4><span class=\"title-square\"></span>1. Nutzung des Dienstes</h4><p>Dieses Spiel ist für alle offen und kostenlos zu spielen.<br>Durch das Spielen des Spiels stimmst du den hier angegebenen Bedingungen zu.</p><br><h4><span class=\"title-square\"></span>2. Konten- und Punktespeicherung</h4><p>Spieler müssen nur einen Namen eingeben, um ihre Punktzahlen zu speichern.<br>Die eingegebenen Namen sind für alle sichtbar.<br>Spieler dürfen während des Spiels keine anstößigen, missbräuchlichen oder illegalen Namen verwenden.</p><br><h4><span class=\"title-square\"></span>3. Urheberrechte</h4><p>Der Spielinhalt (Flaggen, Grafiken, Mechanik) unterliegt dem Urheberrecht.</p><br><h4><span class=\"title-square\"></span>4. Strafen und Kündigung</h4><p>Wenn das Spiel missbraucht oder Schummeln festgestellt wird, können die Punktzahlen der Benutzer gelöscht werden.</p>",
	"gdpr": "<h2><span>PERSONENDAKENSCHUTZ UND DATENSCHUTZRICHTLINIE</span></h2><br><p>Dieser Text wurde gemäß dem Gesetz zum Schutz personenbezogener Daten Nr. 6698 (KVKK) und der Allgemeinen Datenschutzverordnung der Europäischen Union (GDPR) erstellt. Im Folgenden finden Sie Informationen darüber, welche personenbezogenen Daten wir während des Spielens unseres Spiels sammeln, wie wir diese verarbeiten und wie wir sie schützen.</p><br><h4><span class=\"title-square\"></span>1. Wer ist der Datenverantwortliche?</h4><p>Dieses Spiel wird von xuibo betrieben. Wenn Sie uns bezüglich des Schutzes Ihrer personenbezogenen Daten kontaktieren möchten, können Sie uns unter <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a> erreichen.</p><br><h4><span class=\"title-square\"></span>2. Welche personenbezogenen Daten verarbeiten wir?</h4><p>Wir sammeln keine Identitätsdaten direkt, während Sie unser Spiel spielen. Wir können jedoch die folgenden Daten verarbeiten:</p><br><h6><span class=\"title-square\"></span>Erforderliche Daten (für das Spielerlebnis erforderlich)</h6><p>Spielername (Wird in der Rangliste angezeigt)<br>Spieldaten (Punktzahl, Anzahl der richtigen/falschen Antworten usw.)<br>Sound- und Anzeigeeinstellungen (werden im Browser über LocalStorage gespeichert)</p><br><h6><span class=\"title-square\"></span>Automatisch gesammelte Daten</h6><p>IP-Adresse und Geräteinformationen (anonym über Google Analytics gesammelt)<br>Browser- und Betriebssysteminformationen<br>Nutzungsdaten zur Spielperformance (Anzahl der beantworteten Fragen, Spieldauer usw.)</p><br><h6><span class=\"title-square\"></span>Cookies und Tracking-Technologien</h6><p>Unser Spiel kann Cookies verwenden, um anonyme Daten über Google Analytics und ähnliche Tools zu sammeln. Weitere Details finden Sie in unserer <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Cookie-Richtlinie</a>.</p><br><h4><span class=\"title-square\"></span>3. Zwecke der Verarbeitung personenbezogener Daten</h4><p>Sicherstellung der ordnungsgemäßen Funktion des Spiels<br>Erstellung der Rangliste und Anzeige der Spielerplatzierungen<br>Personalisierung des In-Game-Erlebnisses (Stummschaltung des Tons, Vollbildmodus usw.)<br>Analyse und Verbesserung der Spielperformance<br>Sicherheit, Fehlerbehebung und Betrugsprävention<br>Erfüllung gesetzlicher Verpflichtungen</p><br><h4><span class=\"title-square\"></span>4. Mit wem teilen wir personenbezogene Daten?</h4><p>Spielernamen und Punktzahlen in der Rangliste können öffentlich angezeigt werden.<br>Anonyme Daten werden über Google Analytics analysiert, jedoch keine personenbezogenen Daten weitergegeben.<br>Daten können auf rechtliche Anfrage hin mit den zuständigen Behörden geteilt werden.</p><br><h4><span class=\"title-square\"></span>5. Rechtsgrundlage für die Verarbeitung personenbezogener Daten</h4><p>Ihre Daten werden in Übereinstimmung mit dem KVKK und der GDPR auf der Grundlage der folgenden rechtlichen Gründe verarbeitet:<br><br>Vertragserfüllung (KVKK Art. 5/2-c, GDPR Art. 6/1-b) → Sicherstellung der ordnungsgemäßen Funktion des Spiels<br>Berechtigte Interessen (KVKK Art. 5/2-f, GDPR Art. 6/1-f) → Analyse und Verbesserung des Spielerlebnisses<br>Gesetzliche Verpflichtungen (KVKK Art. 5/2-ç, GDPR Art. 6/1-c) → Beantwortung offizieller Anfragen von Behörden</p><br><h4><span class=\"title-square\"></span>6. Wie lange speichern wir Ihre Daten?</h4><p>Spielernamen und Punktzahlen in der Rangliste können unbegrenzt gespeichert werden. Spieler können jedoch die Löschung ihrer Daten anfordern.<br>Google Analytics-Daten werden anonymisiert und nach einer bestimmten Zeit automatisch gelöscht.<br>Lokale Browsereinstellungen (LocalStorage) werden gespeichert, bis der Browser geschlossen wird oder der Benutzer sie manuell löscht.</p><br><h4><span class=\"title-square\"></span>7. Ihre Rechte nach KVKK und GDPR</h4><p>Nach dem KVKK und der GDPR haben Sie die folgenden Rechte:<br><br>- Zu erfahren, ob Ihre Daten verarbeitet werden<br>- Den Zweck der Verarbeitung zu verstehen und wie sie verwendet werden<br>- Die Berichtigung anzufordern, wenn Daten falsch oder unvollständig verarbeitet wurden<br>- Die Löschung oder Anonymisierung Ihrer Daten zu verlangen<br>- Informiert zu werden, wenn Ihre verarbeiteten Daten mit Dritten geteilt werden<br>- Eine Entschädigung zu verlangen, wenn die Verarbeitung unrechtmäßig ist und Schaden verursacht</p><br><p>Um diese Rechte auszuüben, können Sie uns unter <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a> kontaktieren.</p><br><h4><span class=\"title-square\"></span>8. Zusätzliche GDPR-Rechte (für EU-Nutzer)</h4><p>- Recht auf Datenübertragbarkeit: Auf Anfrage können wir Ihre Daten an Sie oder einen anderen Dienstleister übertragen.<br>- Recht auf Widerspruch gegen automatisierte Entscheidungsfindung: Sie können der Auswertung Ihrer Daten durch automatisierte Systeme widersprechen.<br>- Recht auf Widerruf der Einwilligung: Wenn Ihre Daten auf Grundlage Ihrer Einwilligung verarbeitet werden, können Sie Ihre Einwilligung jederzeit widerrufen.</p><br><h4><span class=\"title-square\"></span>9. Cookie-Richtlinie und Einwilligungsoptionen</h4><p>Unser Spiel verwendet Cookies, um das Spielerlebnis zu verbessern. In Übereinstimmung mit den in der Europäischen Union geltenden GDPR-Gesetzen kann Ihre Einwilligung für die Verwendung von Cookies erforderlich sein. Wenn Sie Cookies deaktivieren möchten, können Sie dies in den Browsereinstellungen tun.</p><br><p>Weitere Details finden Sie auf unserer Seite <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Cookie-Richtlinie</a>.</p><br><h4><span class=\"title-square\"></span>10. Aktualisierungen und Änderungen</h4><p>Diese Datenschutzerklärung kann von Zeit zu Zeit aktualisiert werden. Wir werden Sie über wesentliche Änderungen auf unserer Website oder im Spiel benachrichtigen.</p><br><p>Zuletzt aktualisiert: 17.03.2025</p>"
}