{
	"start_game": "EMPEZAR",
	"leaderboard": "TABLA DE PUNTOS",
	"how_to_play_title": "¿CÓMO JUGAR?",
	"contact_title": "CONTACTO",
	"game_settings": "AJUSTES DEL JUEGO",
	"game_difficulty": "Dificultad",
	"game_difficulty_normal": "Normal",
	"game_difficulty_hard": "Difícil",
	"game_number_of_fault": "Número de Errores",
	"game_options_amount": "Opciones",
	"spent_time": "Tiempo Transcurrido",
	"laps_amount": "Número de Vueltas",
	"play_again": "JUGAR DE NUEVO",
	"save": "GUARDAR",
	"send": "ENVIAR",
	"save_score": "GUARDAR PUNTUACIÓN",
	"score_owner": "Propietario de la Puntuación",
	"email_address": "Dirección de Correo Electrónico",
	"message": "Tu Mensaje",
	"go_back": "VOLVER",
	"be_ready": "ESTÉ LISTO",
	"hard": "DIFÍCIL",
	"full_screen_mode_title": "Modo Pantalla Completa",
	"full_screen_mode_desc": "Recomendado para una mejor experiencia de juego",
	"no_record": "No hay registros aquí",
	"global": "GLOBAL",
	"points": "{points} puntos",
	"multiplier": "{multiplier} multiplicador",
	"lap": "{lap} vuelta",
	"game_ended": "JUEGO TERMINADO",
	"privacy_policy_title": "Política de Privacidad",
	"cookie_policy_title": "Política de Cookies",
	"terms_of_use_title": "Términos de Uso",
	"gdpr_title": "Texto de GDPR",
	"main_title": "Rompecabezas de Banderas",
	"main_description": "Descubre banderas con niveles de dificultad, elige la respuesta correcta y gana tu lugar en la tabla de clasificación. ¡Te espera un divertido y competitivo juego de acertijos de banderas!",
	"multiplier_title": "Coeficiente multiplicador:",
	"lives_are_over": "TUS VIDAS SE HAN AGOTADO",
	"return_the_game": "¡Vuelve al juego con una breve pausa publicitaria!",
	"watch_ad": "VER ANUNCIO",
	"end_game": "TERMINAR JUEGO",
	"hours": "horas",
	"minutes": "minutos",
	"seconds": "segundos",
	"sound_on": "Sonido activado",
	"sound_off": "Sonido desactivado",
	"score_saved_successfully": "Puntaje guardado con éxito",
	"message_sent_successfully": "Tu mensaje fue enviado con éxito",
	"invalid_owner": "Información del propietario del puntaje no válida",
	"invalid_email": "Dirección de correo electrónico no válida",
	"occured_an_error": "Ocurrió un error",
	"how_to_play": "<h4><span class=\"title-square\"></span>Objetivo del Juego:</h4><p>¡Pon a prueba tu conocimiento de banderas y trata de obtener la puntuación más alta! ¡Adivina correctamente el país de las banderas que ves en el juego y haz que tu nombre aparezca en la tabla de puntuaciones!</p><br><h4><span class=\"title-square\"></span>Cómo Comenzar el Juego:</h4><p>Selecciona 'Empezar Juego' desde el menú principal.</p><br><h6><span class=\"title-square\"></span>Configura los ajustes del juego:</h6><p><b>Dificultad:</b> Normal o Difícil<br><b>Número de Errores:</b> 1, 3 o 5<br><b>Número de Opciones:</b> 2, 4 o 6<br><b>Modo Pantalla Completa:</b> Activado o Desactivado</p><br><h6><span class=\"title-square\"></span>Cuando comience el juego:</h6><p>Parte superior izquierda: Puntuación y multiplicador actuales<br>Parte superior central: Cuenta atrás de 10 segundos<br>Parte superior derecha: Número de errores (icono de corazón)<br>Botón de silencio/activar sonido</p><br><h4><span class=\"title-square\"></span>Sistema de Puntuación:</h4><p>Los puntos varían según los ajustes seleccionados al inicio del juego:</p><br><p><b>Dificultad:</b> Normal (x1.00), Difícil (x1.50)<br><b>Número de Errores:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Número de Opciones:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Multiplicador por defecto por ronda:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Cómo Ganar el Juego:</h4><p>Si das una respuesta incorrecta, tu número de errores disminuye.<br>Si se acaba el tiempo, el juego termina.<br>Al final del juego, puedes ver tus estadísticas y puntuación.<br>Puedes guardar tu puntuación para entrar en la tabla de puntuaciones.</p>",
	"cookie_policy": "<h2><span>POLÍTICA DE COOKIES</span></h2><br><h4><span class=\"title-square\"></span>¿Qué son las Cookies?</h4><p>Este juego utiliza cookies para mejorar la experiencia del usuario. Las cookies son pequeños archivos de texto almacenados en tu dispositivo y se utilizan para recordar tus ajustes del juego.</p><br><h4><span class=\"title-square\"></span>¿Qué Cookies Usamos?</h4><h6><span class=\"title-square\"></span>Cookies Esenciales:</h6><p>Utilizamos localStorage para guardar los ajustes del sonido del juego.</p><h6><span class=\"title-square\"></span>Cookies Analíticas:</h6><p>Utilizamos Google Analytics para analizar cómo se juega el juego y qué secciones son más populares.</p><h6><span class=\"title-square\"></span>Cookies de Publicidad:</h6><p>Si usamos Google AdSense en el juego, las cookies pueden ser usadas para mostrar anuncios personalizados por Google.</p><br><h4><span class=\"title-square\"></span>¿Puedo Desactivar las Cookies?</h4><p>Puedes eliminar o bloquear las cookies desde los ajustes de tu navegador. Sin embargo, algunas funciones pueden no funcionar correctamente.</p>",
	"privacy_policy": "<h2><span>POLÍTICA DE PRIVACIDAD</span></h2><br><h4><span class=\"title-square\"></span>¿Qué Datos Recopilamos?</h4><p>Los nombres de los jugadores y las puntuaciones se almacenan en la tabla de clasificación.<br>Guardamos tus preferencias dentro del juego (sonido activado/desactivado, etc.) en tu navegador.<br>Analizamos el rendimiento del juego utilizando Google Analytics.</p><br><h4><span class=\"title-square\"></span>¿Cómo Se Utilizan los Datos?</h4><p>Para mejorar la experiencia del jugador<br>Para crear la tabla de clasificación<br>Para analizar el rendimiento del juego</p><br><h4><span class=\"title-square\"></span>¿Compartimos Datos?</h4><p>Tu información personal no se comparte con terceros.<br>Sin embargo, como utilizamos Google Analytics, pueden aplicarse las políticas de cookies de Google.</p><br><h4><span class=\"title-square\"></span>Seguridad de los Datos</h4><p>No se recopila ninguna información personal excepto los nombres de los jugadores y las puntuaciones.<br>Los datos se almacenan y protegen en bases de datos cifradas.</p>",
	"terms_of_use": "<h2><span>CONDICIONES DE USO</span></h2><br><h4><span class=\"title-square\"></span>1. Uso del Servicio</h4><p>Este juego está abierto a todos y es gratuito para jugar.<br>Al jugar el juego, aceptas los términos establecidos aquí.</p><br><h4><span class=\"title-square\"></span>2. Registro de Cuenta y Puntuación</h4><p>Los jugadores solo necesitan ingresar un nombre para guardar sus puntuaciones.<br>Los nombres ingresados son visibles para todos.<br>No se permite el uso de nombres ofensivos, abusivos o ilegales durante el juego.</p><br><h4><span class=\"title-square\"></span>3. Derechos de Propiedad Intelectual</h4><p>El contenido del juego (banderas, gráficos, mecánicas) está sujeto a derechos de autor.</p><br><h4><span class=\"title-square\"></span>4. Penalizaciones y Terminación</h4><p>Si el juego se usa indebidamente o se detecta trampa, las puntuaciones de los usuarios pueden ser eliminadas.</p>",
	"gdpr": "<h2><span>POLÍTICA DE PROTECCIÓN DE DATOS PERSONALES Y PRIVACIDAD</span></h2><br><p>Este texto de divulgación ha sido preparado de acuerdo con la Ley de Protección de Datos Personales No. 6698 (KVKK) y el Reglamento General de Protección de Datos de la Unión Europea (GDPR). A continuación, encontrará información sobre qué datos personales recopilamos mientras juega nuestro juego, cómo los procesamos y cómo los protegemos.</p><br><h4><span class=\"title-square\"></span>1. ¿Quién es el Controlador de Datos?</h4><p>Este juego es operado por xuibo. Si desea contactarnos sobre la protección de sus datos personales, puede comunicarse con nosotros en <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. ¿Qué Datos Personales Procesamos?</h4><p>No recopilamos datos de identidad directamente mientras juega nuestro juego. Sin embargo, podemos procesar los siguientes datos:</p><br><h6><span class=\"title-square\"></span>Datos Obligatorios (Requeridos para la Experiencia del Juego)</h6><p>Nombre del jugador (Visible en la tabla de clasificación)<br>Estadísticas del juego (Puntuación, número de respuestas correctas/incorrectas, etc.)<br>Configuraciones de sonido y visualización (Almacenadas mediante LocalStorage en el navegador)</p><br><h6><span class=\"title-square\"></span>Datos Recopilados Automáticamente</h6><p>Dirección IP e información del dispositivo (Recopilados de manera anónima a través de Google Analytics)<br>Información del navegador y sistema operativo<br>Datos de uso relacionados con el rendimiento del juego (Número de preguntas respondidas, duración del juego, etc.)</p><br><h6><span class=\"title-square\"></span>Cookies y Tecnologías de Seguimiento</h6><p>Nuestro juego puede usar cookies para recopilar datos anónimos a través de Google Analytics y herramientas similares. Para más detalles, consulte nuestra <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Política de Cookies</a>.</p><br><h4><span class=\"title-square\"></span>3. Finalidades del Procesamiento de Datos Personales</h4><p>Asegurar el correcto funcionamiento del juego<br>Crear la tabla de clasificación y mostrar las posiciones de los jugadores<br>Personalizar la experiencia dentro del juego (Desactivar sonido, preferencia de pantalla completa, etc.)<br>Analizar y mejorar el rendimiento del juego<br>Seguridad, depuración y prevención de fraudes<br>Cumplimiento con las obligaciones legales</p><br><h4><span class=\"title-square\"></span>4. ¿Con Quién Compartimos los Datos Personales?</h4><p>Los nombres de los jugadores y las puntuaciones en la tabla de clasificación pueden ser mostrados públicamente.<br>Los datos anónimos se analizan a través de Google Analytics, pero no se comparten datos personales.<br>Los datos pueden ser compartidos con las autoridades competentes bajo solicitudes legales.</p><br><h4><span class=\"title-square\"></span>5. Base Legal para el Procesamiento de Datos Personales</h4><p>Sus datos se procesan de acuerdo con la KVKK y el GDPR en base a los siguientes fundamentos legales:<br><br>Ejercicio de un contrato (KVKK Art.5/2-c, GDPR Art.6/1-b) → Asegurar el correcto funcionamiento del juego<br>Interés legítimo (KVKK Art.5/2-f, GDPR Art.6/1-f) → Analizar y mejorar la experiencia del juego<br>Obligaciones legales (KVKK Art.5/2-ç, GDPR Art.6/1-c) → Responder a solicitudes oficiales de las autoridades</p><br><h4><span class=\"title-square\"></span>6. ¿Cuánto Tiempo Retenemos Sus Datos?</h4><p>Los nombres de los jugadores y las puntuaciones en la tabla de clasificación pueden almacenarse indefinidamente. Sin embargo, los jugadores pueden solicitar la eliminación de sus datos.<br>Los datos de Google Analytics se anonimizan y se eliminan automáticamente después de un período determinado.<br>Las configuraciones locales del navegador (LocalStorage) se almacenan hasta que se cierre el navegador o el usuario las elimine manualmente.</p><br><h4><span class=\"title-square\"></span>7. Sus Derechos Bajo KVKK y GDPR</h4><p>Bajo KVKK y GDPR, tiene los siguientes derechos:<br><br>- Saber si sus datos están siendo procesados<br>- Entender el propósito del procesamiento y cómo se utiliza<br>- Solicitar corrección si los datos son procesados incorrectamente o de manera incompleta<br>- Solicitar la eliminación o anonimización de sus datos<br>- Ser informado si sus datos procesados se comparten con terceros<br>- Solicitar compensación si el procesamiento es ilegal y causa daños</p><br><p>Para ejercer estos derechos, puede contactarnos en <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Derechos Adicionales del GDPR (Para Usuarios de la UE)</h4><p>- Derecho a la Portabilidad de los Datos: Si lo solicita, podemos transferir sus datos a usted o a otro proveedor de servicios.<br>- Derecho a Oponerse a la Toma de Decisiones Automatizadas: Puede oponerse a la evaluación de sus datos por sistemas automatizados.<br>- Derecho a Retirar el Consentimiento: Si sus datos son procesados con su consentimiento, puede retirar su consentimiento en cualquier momento.</p><br><h4><span class=\"title-square\"></span>9. Política de Cookies y Opciones de Consentimiento</h4><p>Nuestro juego utiliza cookies para mejorar la experiencia de juego. De acuerdo con las leyes del GDPR aplicables en la Unión Europea, su consentimiento puede ser requerido para el uso de cookies. Si desea desactivar las cookies, puede hacerlo en la configuración de su navegador.</p><br><p>Para más detalles, visite nuestra página de <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Política de Cookies</a>.</p><br><h4><span class=\"title-square\"></span>10. Actualizaciones y Cambios</h4><p>Esta política de privacidad puede ser actualizada de vez en cuando. Le notificaremos sobre cambios significativos a través de nuestro sitio web o dentro del juego.</p><br><p>Última actualización: 17.03.2025</p>"
}