{
	"start_game": "COMMENCER",
	"leaderboard": "TABLEAU DES MEILLEURS",
	"how_to_play_title": "COMMENT JOUER ?",
	"contact_title": "CONTACT",
	"game_settings": "PARAMÈTRES DU JEU",
	"game_difficulty": "Difficulté",
	"game_difficulty_normal": "Normal",
	"game_difficulty_hard": "Difficile",
	"game_number_of_fault": "Nombre d'erreurs",
	"game_options_amount": "Choix",
	"spent_time": "Temps écoulé",
	"laps_amount": "Nombre de tours",
	"play_again": "JOUER À NOUVEAU",
	"save": "SAUVEGARDER",
	"send": "ENVOYER",
	"save_score": "SAUVEGARDER LE SCORE",
	"score_owner": "Propriétaire du score",
	"email_address": "Adresse e-mail",
	"message": "Votre message",
	"go_back": "RETOURNER",
	"be_ready": "SOYEZ PRÊT",
	"hard": "DIFFICILE",
	"full_screen_mode_title": "Mode plein écran",
	"full_screen_mode_desc": "Recommandé pour une meilleure expérience de jeu",
	"no_record": "Aucun enregistrement ici",
	"global": "MONDIAL",
	"points": "{points} points",
	"multiplier": "{multiplier} multiplicateur",
	"lap": "{lap} tour",
	"game_ended": "JEU TERMINÉ",
	"privacy_policy_title": "Politique de confidentialité",
	"cookie_policy_title": "Politique de cookies",
	"terms_of_use_title": "Conditions d'utilisation",
	"gdpr_title": "Texte RGPD",
	"main_title": "Puzzle des Drapeaux",
	"main_description": "Découvrez des drapeaux avec différents niveaux de difficulté, choisissez la bonne réponse et gagnez votre place dans le classement ! Un jeu de quiz sur les drapeaux amusant et compétitif vous attend!",
	"multiplier_title": "Coefficient multiplicateur:",
	"lives_are_over": "VOS VIES SONT ÉPUISÉES",
	"return_the_game": "Retournez dans le jeu après une courte pause publicitaire !",
	"watch_ad": "REGARDER LA PUBLICITÉ",
	"end_game": "TERMINER LE JEU",
	"hours": "heures",
	"minutes": "minutes",
	"seconds": "secondes",
	"sound_on": "Son activé",
	"sound_off": "Son désactivé",
	"score_saved_successfully": "Score enregistré avec succès",
	"message_sent_successfully": "Votre message a été envoyé avec succès",
	"invalid_owner": "Informations du propriétaire du score invalides",
	"invalid_email": "Adresse e-mail invalide",
	"occured_an_error": "Une erreur est survenue",
	"how_to_play": "<h4><span class=\"title-square\"></span>Objectif du jeu :</h4><p>Testez vos connaissances sur les drapeaux et essayez de gagner le plus de points possible ! Devinez correctement à quel pays appartient chaque drapeau et inscrivez votre nom sur le tableau des meilleurs !</p><br><h4><span class=\"title-square\"></span>Début du jeu :</h4><p>Sélectionnez l'option “Commencer le jeu” depuis le menu principal.</p><br><h6><span class=\"title-square\"></span>Définir les paramètres du jeu :</h6><p><b>Difficulté :</b> Normal ou Difficile<br><b>Nombre d'erreurs :</b> 1, 3 ou 5<br><b>Nombre de choix :</b> 2, 4 ou 6<br><b>Mode plein écran :</b> Activé ou Désactivé</p><br><h6><span class=\"title-square\"></span>Une fois le jeu commencé :</h6><p>Score instantané et multiplicateur en haut à gauche<br>Compte à rebours de 10 secondes en haut au centre<br>Nombre d'erreurs en haut à droite (icône cœur)<br>Bouton pour activer/désactiver le son</p><br><h4><span class=\"title-square\"></span>Système de points :</h4><p>Les points varient en fonction des paramètres choisis au début du jeu :</p><br><p><b>Difficulté :</b> Normal (x1.00), Difficile (x1.50)<br><b>Nombre d'erreurs :</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Nombre de choix :</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Multiplicateur par défaut par tour :</b> x1.00</p><br><h4><span class=\"title-square\"></span>Gagner le jeu :</h4><p>Si vous donnez une mauvaise réponse, vous perdez une tentative.<br>Si le temps est écoulé, le jeu se termine.<br>À la fin du jeu, vous pouvez voir vos statistiques et votre score.<br>Vous pouvez enregistrer votre score pour figurer sur le tableau des meilleurs.</p>",
	"cookie_policy": "<h2><span>POLITIQUE DE COOKIES</span></h2><br><h4><span class=\"title-square\"></span>Qu'est-ce que les cookies ?</h4><p>Ce jeu utilise des cookies pour améliorer l'expérience utilisateur. Les cookies sont de petits fichiers texte enregistrés sur votre appareil et sont utilisés pour mémoriser vos paramètres de jeu.</p><br><h4><span class=\"title-square\"></span>Quels cookies utilisons-nous ?</h4><h6><span class=\"title-square\"></span>Cookies nécessaires :</h6><p>Nous utilisons localStorage pour mémoriser les paramètres de son du jeu.</p><h6><span class=\"title-square\"></span>Cookies analytiques :</h6><p>Nous utilisons Google Analytics pour analyser la façon dont le jeu est joué et quelles sections sont les plus populaires.</p><h6><span class=\"title-square\"></span>Cookies publicitaires :</h6><p>Si nous utilisons Google AdSense dans le jeu, des cookies peuvent être utilisés pour afficher des publicités personnalisées par Google.</p><br><h4><span class=\"title-square\"></span>Puis-je désactiver les cookies ?</h4><p>Vous pouvez supprimer ou bloquer les cookies depuis les paramètres de votre navigateur. Cependant, certaines fonctionnalités peuvent ne pas fonctionner correctement.</p>",
	"privacy_policy": "<h2><span>POLITIQUE DE CONFIDENTIALITÉ</span></h2><br><h4><span class=\"title-square\"></span>Quelles données collectons-nous ?</h4><p>Les noms des joueurs et leurs scores sont stockés dans le classement.<br>Nous enregistrons vos préférences de jeu (son activé/désactivé, etc.) dans votre navigateur.<br>Nous analysons les performances du jeu à l'aide de Google Analytics.</p><br><h4><span class=\"title-square\"></span>Comment les données sont-elles utilisées ?</h4><p>Pour améliorer l'expérience des joueurs<br>Pour créer le classement<br>Pour analyser les performances du jeu</p><br><h4><span class=\"title-square\"></span>Partageons-nous les données ?</h4><p>Vos données personnelles ne sont pas partagées avec des tiers.<br>Cependant, comme nous utilisons Google Analytics, les politiques de cookies de Google peuvent s'appliquer.</p><br><h4><span class=\"title-square\"></span>Sécurité des données</h4><p>Aucune donnée personnelle n'est collectée, à l'exception des noms des joueurs et des scores.<br>Les données sont stockées et protégées dans des bases de données chiffrées.</p>",
	"terms_of_use": "<h2><span>CONDITIONS D'UTILISATION</span></h2><br><h4><span class=\"title-square\"></span>1. Utilisation du service</h4><p>Ce jeu est ouvert à tous et gratuit.<br>En jouant, vous acceptez les conditions énoncées ici.</p><br><h4><span class=\"title-square\"></span>2. Inscription du compte et des scores</h4><p>Les joueurs doivent uniquement entrer un nom pour enregistrer leurs scores.<br>Les noms saisis sont visibles par tous.<br>Il est interdit d'utiliser des noms offensants, abusifs ou illégaux pendant le jeu.</p><br><h4><span class=\"title-square\"></span>3. Droits de propriété intellectuelle</h4><p>Le contenu du jeu (drapeaux, graphismes, mécaniques) est protégé par le droit d'auteur.</p><br><h4><span class=\"title-square\"></span>4. Sanctions et résiliation</h4><p>En cas de mauvaise utilisation du jeu ou de triche détectée, les scores des utilisateurs peuvent être supprimés.</p>",
	"gdpr": "<h2><span>PROTECTION DES DONNÉES PERSONNELLES ET POLITIQUE DE CONFIDENTIALITÉ</span></h2><br><p>Ce texte d'information a été préparé conformément à la loi sur la protection des données personnelles n° 6698 (KVKK) et au Règlement général sur la protection des données (RGPD) de l'Union européenne. Vous trouverez ci-dessous des informations sur les données personnelles que nous collectons lorsque vous jouez à notre jeu, comment nous les traitons et comment nous les protégeons.</p><br><h4><span class=\"title-square\"></span>1. Qui est le Responsable du Traitement des Données ?</h4><p>Ce jeu est exploité par xuibo. Si vous souhaitez nous contacter concernant la protection de vos données personnelles, vous pouvez nous écrire à <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Quelles Données Personnelles Traitions-Nous ?</h4><p>Nous ne collectons pas directement de données d'identité lorsque vous jouez à notre jeu. Cependant, nous pouvons traiter les données suivantes :</p><br><h6><span class=\"title-square\"></span>Données Obligatoires (Nécessaires pour l'Expérience de Jeu)</h6><p>Nom du joueur (affiché sur le classement)<br>Statistiques de jeu (score, nombre de réponses correctes/incorrectes, etc.)<br>Paramètres sonores et visuels (stockés en LocalStorage dans le navigateur)</p><br><h6><span class=\"title-square\"></span>Données Collectées Automatiquement</h6><p>Adresse IP et informations sur l'appareil (collectées de manière anonyme via Google Analytics)<br>Informations sur le navigateur et le système d'exploitation<br>Données d'utilisation relatives aux performances du jeu (nombre de questions répondues, durée de jeu, etc.)</p><br><h6><span class=\"title-square\"></span>Cookies et Technologies de Suivi</h6><p>Notre jeu peut utiliser des cookies pour collecter des données anonymes via Google Analytics et des outils similaires. Pour plus de détails, veuillez consulter notre <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Politique de Cookies</a>.</p><br><h4><span class=\"title-square\"></span>3. Finalités du Traitement des Données Personnelles</h4><p>Assurer le bon fonctionnement du jeu<br>Créer le classement et afficher le classement des joueurs<br>Personnaliser l'expérience de jeu (désactivation du son, préférence plein écran, etc.)<br>Analyser et améliorer les performances du jeu<br>Sécurité, correction des erreurs et prévention de la fraude<br>Respect des obligations légales</p><br><h4><span class=\"title-square\"></span>4. Avec Qui Partageons-Nous les Données Personnelles ?</h4><p>Les noms des joueurs et les scores sur le classement peuvent être affichés publiquement.<br>Les données anonymes sont analysées via Google Analytics, mais aucune donnée personnelle n'est partagée.<br>Les données peuvent être partagées avec les autorités compétentes en cas de demande légale.</p><br><h4><span class=\"title-square\"></span>5. Base Juridique du Traitement des Données Personnelles</h4><p>Vos données sont traitées conformément à la KVKK et au RGPD sur les bases légales suivantes :<br><br>Exécution d'un contrat (KVKK Art.5/2-c, RGPD Art.6/1-b) → Assurer le bon fonctionnement du jeu<br>Intérêt légitime (KVKK Art.5/2-f, RGPD Art.6/1-f) → Analyser et améliorer l'expérience de jeu<br>Obligations légales (KVKK Art.5/2-ç, RGPD Art.6/1-c) → Répondre aux demandes officielles des autorités</p><br><h4><span class=\"title-square\"></span>6. Combien de Temps Conservons-Nous Vos Données ?</h4><p>Les noms des joueurs et les scores du classement peuvent être conservés indéfiniment. Toutefois, les joueurs peuvent demander la suppression de leurs données.<br>Les données Google Analytics sont anonymisées et automatiquement supprimées après une certaine période.<br>Les paramètres stockés localement dans le navigateur (LocalStorage) sont conservés jusqu'à la fermeture du navigateur ou la suppression manuelle par l'utilisateur.</p><br><h4><span class=\"title-square\"></span>7. Vos Droits en vertu de la KVKK et du RGPD</h4><p>Conformément à la KVKK et au RGPD, vous disposez des droits suivants :<br><br>- Savoir si vos données sont traitées<br>- Comprendre l'objectif du traitement et comment elles sont utilisées<br>- Demander la correction si les données sont traitées de manière incorrecte ou incomplète<br>- Demander la suppression ou l'anonymisation de vos données<br>- Être informé si vos données traitées sont partagées avec des tiers<br>- Demander une indemnisation si le traitement est illégal et entraîne un préjudice</p><br><p>Pour exercer ces droits, vous pouvez nous contacter à <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Droits Supplémentaires du RGPD (Pour les Utilisateurs de l'UE)</h4><p>- Droit à la Portabilité des Données : Sur demande, nous pouvons transférer vos données à vous ou à un autre prestataire de services.<br>- Droit d'Opposition à la Prise de Décision Automatisée : Vous pouvez vous opposer à l'évaluation de vos données par des systèmes automatisés.<br>- Droit de Retrait du Consentement : Si vos données sont traitées sur la base de votre consentement, vous pouvez retirer votre consentement à tout moment.</p><br><h4><span class=\"title-square\"></span>9. Politique de Cookies et Options de Consentement</h4><p>Notre jeu utilise des cookies pour améliorer l'expérience de jeu. Conformément aux lois du RGPD applicables dans l'Union européenne, votre consentement peut être requis pour l'utilisation des cookies. Si vous souhaitez désactiver les cookies, vous pouvez le faire dans les paramètres de votre navigateur.</p><br><p>Pour plus de détails, veuillez consulter notre page <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Politique de Cookies</a>.</p><br><h4><span class=\"title-square\"></span>10. Mises à Jour et Modifications</h4><p>Cette politique de confidentialité peut être mise à jour de temps à autre. Nous vous informerons des changements importants via notre site web ou dans le jeu.</p><br><p>Dernière mise à jour : 17.03.2025</p>"
}