{
	"start_game": "शुरू करें",
	"leaderboard": "लीडरबोर्ड",
	"how_to_play_title": "कैसे खेलें?",
	"contact_title": "संपर्क",
	"game_settings": "खेल सेटिंग्स",
	"game_difficulty": "कठिनाई",
	"game_difficulty_normal": "साधारण",
	"game_difficulty_hard": "कठिन",
	"game_number_of_fault": "गलतियों की संख्या",
	"game_options_amount": "विकल्प",
	"spent_time": "समय बिताया",
	"laps_amount": "लैप्स की संख्या",
	"play_again": "फिर से खेलें",
	"save": "सहेजें",
	"send": "भेजें",
	"save_score": "स्कोर सहेजें",
	"score_owner": "स्कोर मालिक",
	"email_address": "ईमेल पता",
	"message": "आपका संदेश",
	"go_back": "वापस जाएं",
	"be_ready": "तैयार हो जाओ",
	"hard": "कठिन",
	"full_screen_mode_title": "पूर्ण स्क्रीन मोड",
	"full_screen_mode_desc": "बेहतर खेल अनुभव के लिए अनुशंसित",
	"no_record": "यहां कोई रिकॉर्ड नहीं है",
	"global": "वैश्विक",
	"points": "{points} अंक",
	"multiplier": "{multiplier} गुणक",
	"lap": "{lap} लैप",
	"game_ended": "खेल समाप्त",
	"privacy_policy_title": "गोपनीयता नीति",
	"cookie_policy_title": "कुकी नीति",
	"terms_of_use_title": "उपयोग की शर्तें",
	"gdpr_title": "GDPR पाठ",
	"main_title": "ध्वज पहेली",
	"main_description": "विभिन्न कठिनाई स्तरों के साथ ध्वजों की खोज करें, सही उत्तर चुनें और लीडरबोर्ड में अपनी जगह बनाएं! मजेदार और प्रतिस्पर्धी ध्वज क्विज़ खेल आपका इंतजार कर रहा है!",
	"multiplier_title": "गुणांक गुणांक:",
	"lives_are_over": "आपके जीवन समाप्त हो गए हैं",
	"return_the_game": "एक छोटे विज्ञापन ब्रेक के बाद खेल में वापस जाएं!",
	"watch_ad": "विज्ञापन देखें",
	"end_game": "खेल समाप्त करें",
	"hours": "घंटे",
	"minutes": "मिनट",
	"seconds": "सेकंड",
	"sound_on": "ध्वनि चालू",
	"sound_off": "ध्वनि बंद",
	"score_saved_successfully": "स्कोर सफलतापूर्वक सहेजा गया",
	"message_sent_successfully": "आपका संदेश सफलतापूर्वक भेजा गया",
	"invalid_owner": "अमान्य स्कोर मालिक जानकारी",
	"invalid_email": "अमान्य ईमेल पता",
	"occured_an_error": "एक त्रुटि उत्पन्न हुई",
	"how_to_play": "<h4><span class=\"title-square\"></span>खेल का उद्देश्य:</h4><p>अपने ध्वज ज्ञान का परीक्षण करें और उच्चतम स्कोर करने का प्रयास करें! खेल में जो ध्वज आप देखते हैं, उनका सही देश अनुमान लगाकर अपने नाम को लीडरबोर्ड पर रखें!</p><br><h4><span class=\"title-square\"></span>खेल शुरू करना:</h4><p>मुख्य मेनू से 'खेल शुरू करें' चुनें।</p><br><h6><span class=\"title-square\"></span>खेल सेटिंग्स सेट करें:</h6><p><b>कठिनाई:</b> साधारण या कठिन<br><b>गलतियों की संख्या:</b> 1, 3, या 5<br><b>विकल्पों की संख्या:</b> 2, 4, या 6<br><b>पूर्ण स्क्रीन मोड:</b> चालू या बंद</p><br><h6><span class=\"title-square\"></span>जब खेल शुरू होता है:</h6><p>बाएं ऊपर: वर्तमान स्कोर और गुणक<br>मध्य ऊपर: 10-सेकंड की काउंटडाउन<br>दाएं ऊपर: गलतियों की संख्या (हृदय आइकन)<br>मौन/अनमौन बटन</p><br><h4><span class=\"title-square\"></span>स्कोरिंग सिस्टम:</h4><p>स्कोर, खेल की शुरुआत में चुनी गई सेटिंग्स के आधार पर बदलते हैं:</p><br><p><b>कठिनाई:</b> साधारण (x1.00), कठिन (x1.50)<br><b>गलतियों की संख्या:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>विकल्पों की संख्या:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>प्रत्येक दौर का डिफ़ॉल्ट गुणक:</b> x1.00</p><br><h4><span class=\"title-square\"></span>खेल जीतने का तरीका:</h4><p>यदि आप गलत उत्तर देते हैं, तो आपकी गलती की संख्या घट जाती है।<br>यदि समय समाप्त हो जाता है, तो खेल समाप्त हो जाता है।<br>खेल के अंत में, आप अपनी आँकड़े और स्कोर देख सकते हैं।<br>आप अपना स्कोर सहेज सकते हैं ताकि आप लीडरबोर्ड पर प्रवेश कर सकें।</p>",
	"cookie_policy": "<h2><span>कुकी नीति</span></h2><br><h4><span class=\"title-square\"></span>कुकीज़ क्या हैं?</h4><p>यह खेल उपयोगकर्ता अनुभव को सुधारने के लिए कुकीज़ का उपयोग करता है। कुकीज़ छोटे पाठ फ़ाइलें हैं जो आपके उपकरण पर संग्रहित होती हैं और आपके खेल सेटिंग्स को याद रखने के लिए उपयोग की जाती हैं।</p><br><h4><span class=\"title-square\"></span>हम कौन सी कुकीज़ उपयोग करते हैं?</h4><h6><span class=\"title-square\"></span>आवश्यक कुकीज़:</h6><p>हम खेल ध्वनि सेटिंग्स को बचाने के लिए localStorage का उपयोग करते हैं।</p><h6><span class=\"title-square\"></span>विश्लेषणात्मक कुकीज़:</h6><p>हम Google Analytics का उपयोग करते हैं ताकि हम यह विश्लेषण कर सकें कि खेल कैसे खेला जा रहा है और कौन से सेक्शन अधिक लोकप्रिय हैं।</p><h6><span class=\"title-square\"></span>विज्ञापन कुकीज़:</h6><p>यदि हम खेल में Google AdSense का उपयोग करते हैं, तो कुकीज़ का उपयोग Google द्वारा व्यक्तिगत विज्ञापन दिखाने के लिए किया जा सकता है।</p><br><h4><span class=\"title-square\"></span>क्या मैं कुकीज़ को अक्षम कर सकता हूँ?</h4><p>आप अपने ब्राउज़र सेटिंग्स से कुकीज़ को हटा सकते हैं या ब्लॉक कर सकते हैं। हालांकि, कुछ सुविधाएँ सही ढंग से काम नहीं कर सकती हैं।</p>",
	"privacy_policy": "<h2><span>गोपनीयता नीति</span></h2><br><h4><span class=\"title-square\"></span>हम कौन सी जानकारी एकत्र करते हैं?</h4><p>खिलाड़ी के नाम और स्कोर को लीडरबोर्ड में संग्रहित किया जाता है।<br>हम आपके इन-गेम प्राथमिकताओं (ध्वनि चालू/बंद, आदि) को आपके ब्राउज़र में सहेजते हैं।<br>हम Google Analytics का उपयोग करके खेल प्रदर्शन का विश्लेषण करते हैं।</p><br><h4><span class=\"title-square\"></span>डेटा का उपयोग कैसे किया जाता है?</h4><p>खिलाड़ी के अनुभव को सुधारने के लिए<br>लीडरबोर्ड बनाने के लिए<br>खेल प्रदर्शन का विश्लेषण करने के लिए</p><br><h4><span class=\"title-square\"></span>क्या हम डेटा साझा करते हैं?</h4><p>आपका व्यक्तिगत डेटा तीसरे पक्ष के साथ साझा नहीं किया जाता है।<br>हालांकि, हम Google Analytics का उपयोग करते हैं, इसलिए Google की अपनी कुकी नीतियां लागू हो सकती हैं।</p><br><h4><span class=\"title-square\"></span>डेटा सुरक्षा</h4><p>खिलाड़ी के नाम और स्कोर के अलावा कोई व्यक्तिगत डेटा एकत्र नहीं किया जाता है।<br>डेटा को एन्क्रिप्टेड डेटाबेस में संग्रहीत और सुरक्षित किया जाता है।</p>",
	"terms_of_use": "<h2><span>उपयोग की शर्तें</span></h2><br><h4><span class=\"title-square\"></span>1. सेवा का उपयोग</h4><p>यह खेल सभी के लिए खुला है और इसे खेलने के लिए मुफ्त है।<br>खेल खेलने से आप यहाँ उल्लिखित शर्तों से सहमत होते हैं।</p><br><h4><span class=\"title-square\"></span>2. खाता और स्कोर पंजीकरण</h4><p>खिलाड़ियों को केवल अपना नाम दर्ज करना होता है ताकि वे अपने स्कोर को सहेज सकें।<br>दर्ज किए गए नाम सभी के लिए दृश्यमान होते हैं।<br>खिलाड़ियों को खेल के दौरान आपत्तिजनक, अपमानजनक या अवैध नामों का उपयोग करने की अनुमति नहीं है।</p><br><h4><span class=\"title-square\"></span>3. बौद्धिक संपत्ति अधिकार</h4><p>खेल सामग्री (झंडे, ग्राफिक्स, यांत्रिकी) कॉपीराइट से सुरक्षित है।</p><br><h4><span class=\"title-square\"></span>4. दंड और समाप्ति</h4><p>यदि खेल का दुरुपयोग किया जाता है या धोखाधड़ी का पता चलता है, तो उपयोगकर्ताओं के स्कोर को हटा दिया जा सकता है।</p>",
	"gdpr": "<h2><span>व्यक्तिगत डेटा सुरक्षा और गोपनीयता नीति</span></h2><br><p>यह प्रकटीकरण पाठ व्यक्तिगत डेटा सुरक्षा कानून संख्या 6698 (KVKK) और यूरोपीय संघ सामान्य डेटा सुरक्षा विनियमन (GDPR) के अनुसार तैयार किया गया है। नीचे, आप खेल खेलते समय हम जो व्यक्तिगत डेटा एकत्र करते हैं, उसे कैसे प्रक्रिया करते हैं और हम इसे कैसे सुरक्षित रखते हैं, के बारे में जानकारी पा सकते हैं।</p><br><h4><span class=\"title-square\"></span>1. डेटा नियंत्रक कौन है?</h4><p>यह खेल xuibo द्वारा संचालित किया जाता है। यदि आप अपने व्यक्तिगत डेटा की सुरक्षा के बारे में हमसे संपर्क करना चाहते हैं, तो आप हमें <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a> पर संपर्क कर सकते हैं।</p><br><h4><span class=\"title-square\"></span>2. हम कौन सा व्यक्तिगत डेटा प्रोसेस करते हैं?</h4><p>हम खेल खेलते समय सीधे पहचान डेटा एकत्र नहीं करते हैं। हालांकि, हम निम्नलिखित डेटा प्रोसेस कर सकते हैं:</p><br><h6><span class=\"title-square\"></span>अनिवार्य डेटा (खेल अनुभव के लिए आवश्यक)</h6><p>खिलाड़ी का नाम (लीडरबोर्ड पर प्रदर्शित)<br>खेल सांख्यिकी (स्कोर, सही/गलत उत्तरों की संख्या, आदि)<br>ध्वनि और दृश्य सेटिंग्स (ब्राउज़र में LocalStorage का उपयोग करके संग्रहित)</p><br><h6><span class=\"title-square\"></span>स्वचालित रूप से एकत्र किया गया डेटा</h6><p>IP पता और डिवाइस जानकारी (Google Analytics के माध्यम से गुमनाम रूप से एकत्रित)<br>ब्राउज़र और ऑपरेटिंग सिस्टम जानकारी<br>खेल प्रदर्शन से संबंधित उपयोग डेटा (उत्तर दिए गए प्रश्नों की संख्या, खेल अवधि, आदि)</p><br><h6><span class=\"title-square\"></span>कुकीज़ और ट्रैकिंग प्रौद्योगिकियाँ</h6><p>हमारा खेल गूगल एनालिटिक्स और समान उपकरणों के माध्यम से गुमनाम डेटा एकत्र करने के लिए कुकीज़ का उपयोग कर सकता है। अधिक विवरण के लिए, कृपया हमारी <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">कुकी नीति</a> जांचें।</p><br><h4><span class=\"title-square\"></span>3. व्यक्तिगत डेटा प्रोसेसिंग के उद्देश्य</h4><p>खेल के उचित संचालन को सुनिश्चित करना<br>लीडरबोर्ड बनाना और खिलाड़ी की रैंकिंग प्रदर्शित करना<br>खेल अनुभव को वैयक्तिकृत करना (ध्वनि म्यूट करना, फुल-स्क्रीन प्राथमिकता, आदि)<br>खेल प्रदर्शन का विश्लेषण और सुधारना<br>सुरक्षा, डिबगिंग और धोखाधड़ी रोकथाम<br>कानूनी दायित्वों का पालन करना</p><br><h4><span class=\"title-square\"></span>4. हम व्यक्तिगत डेटा किसके साथ साझा करते हैं?</h4><p>खिलाड़ी के नाम और स्कोर लीडरबोर्ड पर सार्वजनिक रूप से प्रदर्शित हो सकते हैं।<br>गुमनाम डेटा को Google Analytics के माध्यम से विश्लेषित किया जाता है, लेकिन कोई व्यक्तिगत डेटा साझा नहीं किया जाता है।<br>कानूनी अनुरोधों पर डेटा को प्राधिकृत अधिकारियों के साथ साझा किया जा सकता है।</p><br><h4><span class=\"title-square\"></span>5. व्यक्तिगत डेटा प्रोसेसिंग के लिए कानूनी आधार</h4><p>आपका डेटा KVKK और GDPR के अनुसार निम्नलिखित कानूनी आधार पर प्रोसेस किया जाता है:<br><br>संविदा का प्रदर्शन (KVKK अनुच्छेद 5/2-c, GDPR अनुच्छेद 6/1-b) → खेल के उचित संचालन को सुनिश्चित करना<br>वैध हित (KVKK अनुच्छेद 5/2-f, GDPR अनुच्छेद 6/1-f) → खेल अनुभव का विश्लेषण और सुधारना<br>कानूनी दायित्व (KVKK अनुच्छेद 5/2-ç, GDPR अनुच्छेद 6/1-c) → अधिकारियों से आधिकारिक अनुरोधों का उत्तर देना</p><br><h4><span class=\"title-square\"></span>6. हम आपका डेटा कितने समय तक बनाए रखते हैं?</h4><p>खिलाड़ी के नाम और स्कोर लीडरबोर्ड पर अनिश्चितकाल के लिए संग्रहीत किए जा सकते हैं। हालांकि, खिलाड़ी अपने डेटा को हटाने का अनुरोध कर सकते हैं।<br>Google Analytics डेटा को गुमनाम किया जाता है और एक निश्चित अवधि के बाद स्वचालित रूप से हटा दिया जाता है।<br>स्थानीय ब्राउज़र सेटिंग्स (LocalStorage) को ब्राउज़र बंद होने तक या उपयोगकर्ता द्वारा मैन्युअल रूप से साफ किए जाने तक संग्रहित किया जाता है।</p><br><h4><span class=\"title-square\"></span>7. KVKK और GDPR के तहत आपके अधिकार</h4><p>KVKK और GDPR के तहत, आपके पास निम्नलिखित अधिकार हैं:<br><br>- यह जानने का अधिकार कि आपका डेटा प्रोसेस किया जा रहा है या नहीं<br>- प्रोसेसिंग का उद्देश्य और इसका उपयोग कैसे किया जा रहा है, इसे समझने का अधिकार<br>- यदि डेटा गलत या अधूरा प्रोसेस किया गया है तो सुधारने का अधिकार<br>- अपने डेटा को हटाने या गुमनाम करने का अधिकार<br>- यह जानने का अधिकार कि आपका प्रोसेस किया गया डेटा तीसरे पक्ष के साथ साझा किया गया है या नहीं<br>- यदि प्रोसेसिंग अवैध है और नुकसान का कारण बनती है, तो मुआवजा प्राप्त करने का अधिकार</p><br><p>इन अधिकारों का उपयोग करने के लिए, आप हमें <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a> पर संपर्क कर सकते हैं।</p><br><h4><span class=\"title-square\"></span>8. अतिरिक्त GDPR अधिकार (EU उपयोगकर्ताओं के लिए)</h4><p>- डेटा पोर्टेबिलिटी का अधिकार: यदि अनुरोध किया जाता है, तो हम आपका डेटा आपको या किसी अन्य सेवा प्रदाता को स्थानांतरित कर सकते हैं।<br>- स्वचालित निर्णय-निर्माण पर आपत्ति का अधिकार: आप स्वचालित प्रणालियों द्वारा आपके डेटा के मूल्यांकन पर आपत्ति कर सकते हैं।<br>- सहमति वापस लेने का अधिकार: यदि आपका डेटा आपकी सहमति पर प्रोसेस किया जाता है, तो आप कभी भी अपनी सहमति वापस ले सकते हैं।</p><br><h4><span class=\"title-square\"></span>9. कुकी नीति और सहमति विकल्प</h4><p>हमारा खेल कुकीज़ का उपयोग करता है ताकि खेल अनुभव को बढ़ाया जा सके। यूरोपीय संघ में लागू GDPR कानूनों के अनुसार, कुकी उपयोग के लिए आपकी सहमति आवश्यक हो सकती है। यदि आप कुकीज़ को अक्षम करना चाहते हैं, तो आप इसे अपने ब्राउज़र सेटिंग्स में कर सकते हैं।</p><br><p>अधिक जानकारी के लिए, कृपया हमारी <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">कुकी नीति</a> पृष्ठ पर जाएं।</p><br><h4><span class=\"title-square\"></span>10. अद्यतन और परिवर्तन</h4><p>यह गोपनीयता नीति समय-समय पर अपडेट की जा सकती है। हम महत्वपूर्ण परिवर्तनों की जानकारी आपको हमारी वेबसाइट या खेल के भीतर देंगे।</p><br><p>अंतिम अपडेट: 17.03.2025</p>"
}