{
	"start_game": "KEZDJ EL",
	"leaderboard": "VEZETŐK",
	"how_to_play_title": "HOGYAN JÁTSZUNK?",
	"contact_title": "KAPCSOLAT",
	"game_settings": "JÁTÉK BEÁLLÍTÁSOK",
	"game_difficulty": "Nehézség",
	"game_difficulty_normal": "Normál",
	"game_difficulty_hard": "Nehéz",
	"game_number_of_fault": "Hibák száma",
	"game_options_amount": "Opciók",
	"spent_time": "Eltelt idő",
	"laps_amount": "Körök száma",
	"play_again": "JÁTSZANI ÚJRA",
	"save": "MENTÉS",
	"send": "KÜLDÉS",
	"save_score": "EREDMÉNY MEGŐRZÉSE",
	"score_owner": "Eredmény Tulajdonosa",
	"email_address": "Email cím",
	"message": "Üzeneted",
	"go_back": "VISSZA",
	"be_ready": "KÉSZEN ÁLLNI",
	"hard": "NEHÉZ",
	"full_screen_mode_title": "Teljes képernyő mód",
	"full_screen_mode_desc": "Ajánlott jobb játékélmény érdekében",
	"no_record": "Nincs felvétel itt",
	"global": "GLOBALIS",
	"points": "{points} pont",
	"multiplier": "{multiplier} szorzó",
	"lap": "{lap} kör",
	"game_ended": "JÁTÉK VÉGE",
	"privacy_policy_title": "Adatvédelmi irányelvek",
	"cookie_policy_title": "Cookie irányelvek",
	"terms_of_use_title": "Felhasználási feltételek",
	"gdpr_title": "GDPR Szöveg",
	"main_title": "Flag Puzzle",
	"main_description": "Fedezd fel a különböző nehézségi szintű zászlókat, válaszd ki a helyes választ, és szerezz helyet a ranglistán! Egy szórakoztató és versenyképes zászlós kvízjáték vár rád!",
	"multiplier_title": "Szorzó tényező:",
	"lives_are_over": "AZ ÉLETED VÉGET ÉRT",
	"return_the_game": "Térj vissza a játékhoz egy rövid reklámszünet után!",
	"watch_ad": "REKLÁM MEGTEKINTÉSE",
	"end_game": "JÁTÉK BEFEJEZÉSE",
	"hours": "órák",
	"minutes": "percek",
	"seconds": "másodpercek",
	"sound_on": "Hang érez",
	"sound_off": "Hang ki",
	"score_saved_successfully": "Pontszám sikeresen elmentve",
	"message_sent_successfully": "Üzeneted sikeresen elküldve",
	"invalid_owner": "Érvénytelen pontszám tulajdonos információ",
	"invalid_email": "Érvénytelen e-mail cím",
	"occured_an_error": "Hiba történt",
	"how_to_play": "<h4><span class=\"title-square\"></span>Játék célja:</h4><p>Teszteld a zászló tudásodat, és próbáld megszerezni a legmagasabb pontszámot! Találd ki a játékban látott zászlók országát helyesen, és kerülhetsz a vezető táblázatra!</p><br><h4><span class=\"title-square\"></span>Játék indítása:</h4><p>Válaszd a 'Kezdj el játszani' lehetőséget a főmenüből.</p><br><h6><span class=\"title-square\"></span>Állítsd be a játék beállításokat:</h6><p><b>Nehézség:</b> Normál vagy Nehéz<br><b>Hibák száma:</b> 1, 3 vagy 5<br><b>Opciók száma:</b> 2, 4 vagy 6<br><b>Teljes képernyős mód:</b> Be vagy Ki</p><br><h6><span class=\"title-square\"></span>Amikor elindul a játék:</h6><p>Bal fent: Aktuális pontszám és szorzó<br>Közép fent: 10 másodperces visszaszámlálás<br>Jobb fent: Hibák száma (szív ikon)<br>Némítás/néma állapot gomb</p><br><h4><span class=\"title-square\"></span>Pontozási rendszer:</h4><p>A pontok változnak a játék beállításai alapján:</p><br><p><b>Nehézség:</b> Normál (x1.00), Nehéz (x1.50)<br><b>Hibák száma:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Opciók száma:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Alapértelmezett szorzó kereként:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Hogyan nyerheted meg a játékot:</h4><p>Ha helytelen választ adsz, a hibáid száma csökken.<br>Ha lejár az idő, a játék véget ér.<br>A játék végén megtekintheted a statisztikáidat és az eredményedet.<br>Mentheted az eredményedet, hogy bekerülj a vezető táblázatra.</p>",
	"cookie_policy": "<h2><span>COOKIE IRÁNYELVEK</span></h2><br><h4><span class=\"title-square\"></span>Mi az a Cookie?</h4><p>Ez a játék cookie-kat használ a felhasználói élmény javítására. A cookie-k kis szöveges fájlok, amelyek a készülékeden tárolódnak, és arra szolgálnak, hogy megjegyezzék a játék beállításait.</p><br><h4><span class=\"title-square\"></span>Milyen cookie-kat használunk?</h4><h6><span class=\"title-square\"></span>Alapvető cookie-k:</h6><p>A localStorage-t használjuk a játék hangbeállításainak mentésére.</p><h6><span class=\"title-square\"></span>Analitikai cookie-k:</h6><p>A Google Analytics-et használjuk a játék elemzésére és annak megértésére, hogy mely szakaszok népszerűbbek.</p><h6><span class=\"title-square\"></span>Reklám cookie-k:</h6><p>Ha Google AdSense-t használunk a játékban, a cookie-k segítségével személyre szabott hirdetéseket jeleníthet meg a Google.</p><br><h4><span class=\"title-square\"></span>Lehet-e letiltani a cookie-kat?</h4><p>Törölheted vagy blokkolhatod a cookie-kat a böngésződ beállításaiban. Azonban előfordulhat, hogy bizonyos funkciók nem működnek megfelelően.</p>",
	"privacy_policy": "<h2><span>ADATVÉDELMI IGAZOLÁS</span></h2><br><h4><span class=\"title-square\"></span>Milyen adatokat gyűjtünk?</h4><p>A játékosok nevei és pontszámai tárolásra kerülnek az eredménylistán.<br>A játékban használt preferenciákat (hang be-/kikapcsolás stb.) a böngészőjében tároljuk.<br>A játék teljesítményét a Google Analytics segítségével elemezzük.</p><br><h4><span class=\"title-square\"></span>Hogyan használjuk fel az adatokat?</h4><p>A játékos élményének javítására<br>Az eredménylista létrehozása<br>A játék teljesítményének elemzése</p><br><h4><span class=\"title-square\"></span>Megosztjuk az adatokat?</h4><p>Személyes adatokat nem osztunk meg harmadik felekkel.<br>Azonban mivel a Google Analytics-et használjuk, a Google saját cookie-szabályzatai alkalmazhatók.</p><br><h4><span class=\"title-square\"></span>Adatvédelem</h4><p>Semmilyen személyes adat nem kerül gyűjtésre a játékosok nevein és pontszámain kívül.<br>Az adatokat titkosított adatbázisokban tároljuk és védjük.</p>",
	"terms_of_use": "<h2><span>HASZNÁLATI FELTÉTELEK</span></h2><br><h4><span class=\"title-square\"></span>1. A szolgáltatás használata</h4><p>Ez a játék mindenki számára nyitott és ingyenesen játszható.<br>A játékban való részvétellel elfogadja az itt leírt feltételeket.</p><br><h4><span class=\"title-square\"></span>2. Fiók és pontszám regisztrálása</h4><p>A játékosoknak csak egy nevet kell megadniuk ahhoz, hogy menthessék pontjaikat.<br>A megadott nevek mindenki számára láthatóak.<br>A játékosok nem használhatnak sértő, durva vagy illegális neveket a játék során.</p><br><h4><span class=\"title-square\"></span>3. Szellemi tulajdonjogok</h4><p>A játék tartalma (zászlók, grafikák, mechanika) szerzői jogi védelem alatt áll.</p><br><h4><span class=\"title-square\"></span>4. Büntetések és megszüntetés</h4><p>Ha a játékot visszaélik vagy csalásra derül fény, a felhasználók pontszámait törölhetjük.</p>",
	"gdpr": "<h2><span>SZEMÉLYES ADATVÉDELEM ÉS ADATVÉDELMI IGAZOLÁS</span></h2><br><p>Ezt az adatvédelmi tájékoztatót a 6698. számú Személyes Adatvédelmi Törvény (KVKK) és az Európai Unió Általános Adatvédelmi Rendelete (GDPR) alapján készítettük el. Az alábbiakban tájékoztatást adunk arról, hogy milyen személyes adatokat gyűjtünk, hogyan dolgozzuk fel őket, és hogyan védjük meg őket, miközben játszik a játékunkkal.</p><br><h4><span class=\"title-square\"></span>1. Ki az adatkezelő?</h4><p>Ez a játék az xuibo által üzemeltetett. Ha kapcsolatba szeretne lépni velünk személyes adatai védelme érdekében, elérhet minket az alábbi e-mail címen: <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Milyen személyes adatokat dolgozunk fel?</h4><p>A játékunk során nem gyűjtünk közvetlenül személyazonosító adatokat. Azonban az alábbi adatokat dolgozhatjuk fel:</p><br><h6><span class=\"title-square\"></span>Kötelező adatok (a játékélményhez szükséges)</h6><p>Játékos név (megjelenik az eredménylistán)<br>Játék statisztikák (pontszám, helyes/hibás válaszok száma stb.)<br>Hang- és vizuális beállítások (LocalStorage segítségével a böngészőben tárolva)</p><br><h6><span class=\"title-square\"></span>Automatikusan gyűjtött adatok</h6><p>IP-cím és eszközinformációk (anonim módon gyűjtve a Google Analytics-en keresztül)<br>Böngésző- és operációs rendszer információk<br>A játék teljesítményével kapcsolatos használati adatok (válaszolt kérdések száma, játék időtartama stb.)</p><br><h6><span class=\"title-square\"></span>Cookie-k és nyomon követési technológiák</h6><p>A játékunk cookie-kat használhat anonim adatok gyűjtésére a Google Analytics és hasonló eszközök segítségével. További részletekért kérjük, olvassa el <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Cookie Szabályzatunkat</a>.</p><br><h4><span class=\"title-square\"></span>3. A személyes adatok feldolgozásának céljai</h4><p>A játék megfelelő működésének biztosítása<br>Az eredménylista létrehozása és a játékosok rangsorának megjelenítése<br>A játékbeli élmény személyre szabása (hang némítása, teljes képernyő preferencia stb.)<br>A játék teljesítményének elemzése és javítása<br>Biztonság, hibakeresés és csalásmegelőzés<br>Jogi kötelezettségek teljesítése</p><br><h4><span class=\"title-square\"></span>4. Kivel osztjuk meg a személyes adatokat?</h4><p>A játékosok nevei és pontszámai az eredménylistán nyilvánosan megjelenhetnek.<br>Az anonim adatokat a Google Analytics segítségével elemezzük, de semmilyen személyes adatot nem osztunk meg.<br>Az adatokat jogi kérések alapján megoszthatjuk a jogosult hatóságokkal.</p><br><h4><span class=\"title-square\"></span>5. A személyes adatok feldolgozásának jogi alapja</h4><p>Adatait a KVKK és a GDPR előírásai szerint az alábbi jogi alapok alapján dolgozzuk fel:<br><br>Szerződés teljesítése (KVKK 5. cikk 2. pont c) bekezdés, GDPR 6. cikk 1. pont b) bekezdés) → A játék megfelelő működésének biztosítása<br>Jogi érdek (KVKK 5. cikk 2. pont f) bekezdés, GDPR 6. cikk 1. pont f) bekezdés) → A játékélmény elemzése és javítása<br>Jogi kötelezettségek (KVKK 5. cikk 2. pont ç) bekezdés, GDPR 6. cikk 1. pont c) bekezdés) → A hatóságok hivatalos kéréseinek teljesítése</p><br><h4><span class=\"title-square\"></span>6. Mennyi ideig tároljuk az adatokat?</h4><p>A játékosok nevei és pontszámai az eredménylistán korlátlan ideig tárolhatók. Azonban a játékosok kérhetik adataik törlését.<br>A Google Analytics adatok anonimizálásra kerülnek, és egy meghatározott idő elteltével automatikusan törlődnek.<br>A helyi böngésző beállításokat (LocalStorage) a böngésző bezárásáig vagy a felhasználó általi manuális törlésig tároljuk.</p><br><h4><span class=\"title-square\"></span>7. Az Ön jogai a KVKK és a GDPR alapján</h4><p>A KVKK és a GDPR alapján Ön az alábbi jogokkal rendelkezik:<br><br>- Megtudni, hogy az adatait feldolgozzák-e<br>- Megérteni a feldolgozás célját és hogyan használják azokat<br>- Kérni az adatok kijavítását, ha azok helytelenül vagy hiányosan kerültek feldolgozásra<br>- Kérni az adatai törlését vagy anonimizálását<br>- Tájékoztatást kérni, ha a feldolgozott adatokat harmadik felekkel megosztják<br>- Kártérítést kérni, ha az adatkezelés jogellenes, és kárt okozott</p><br><p>Ezért az Ön jogainak érvényesítéséhez vegye fel velünk a kapcsolatot az alábbi e-mail címen: <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. További GDPR jogok (EU felhasználók számára)</h4><p>- Adathordozhatósághoz való jog: Kérésre átadhatjuk Önnek vagy egy másik szolgáltatónak az adatait.<br>- Automatizált döntéshozatal elleni jog: Tiltakozhat az adatai automatizált rendszerek általi értékelése ellen.<br>- Hozzájárulás visszavonásának joga: Ha az adatait hozzájárulása alapján dolgozzuk fel, bármikor visszavonhatja azt.</p><br><h4><span class=\"title-square\"></span>9. Cookie Szabályzat és beleegyezési lehetőségek</h4><p>A játékunk cookie-kat használ a játékélmény javítása érdekében. Az Európai Unióban alkalmazandó GDPR törvényeknek megfelelően, a cookie-k használatához beleegyezése szükséges. Ha szeretné letiltani a cookie-kat, ezt megteheti a böngésző beállításaiban.</p><br><p>További részletekért kérjük, látogasson el <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Cookie Szabályzatunk</a> oldalára.</p><br><h4><span class=\"title-square\"></span>10. Frissítések és változtatások</h4><p>Ez az adatvédelmi irányelv időről időre frissülhet. A jelentős változásokról értesítést küldünk a weboldalunkon vagy a játékban.</p><br><p>Utolsó frissítés: 2025. március 17.</p>"
}