{
	"start_game": "INIZIA",
	"leaderboard": "CLASSIFICA",
	"how_to_play_title": "COME GIOCARE?",
	"contact_title": "CONTATTO",
	"game_settings": "IMPOSTAZIONI DEL GIOCO",
	"game_difficulty": "Difficoltà",
	"game_difficulty_normal": "Normale",
	"game_difficulty_hard": "Difficile",
	"game_number_of_fault": "Numero di Errori",
	"game_options_amount": "Opzioni",
	"spent_time": "Tempo Trascorso",
	"laps_amount": "Numero di Giri",
	"play_again": "GIOCA DI NUOVO",
	"save": "SALVA",
	"send": "INVIA",
	"save_score": "SALVA PUNTEGGIO",
	"score_owner": "Proprietario del Punteggio",
	"email_address": "Indirizzo Email",
	"message": "Il tuo messaggio",
	"go_back": "TORNA INDIETRO",
	"be_ready": "PREPARATI",
	"hard": "DIFFICILE",
	"full_screen_mode_title": "Modalità a Schermo Intero",
	"full_screen_mode_desc": "Consigliato per una migliore esperienza di gioco",
	"no_record": "Nessun record qui",
	"global": "GLOBALE",
	"points": "{points} punti",
	"multiplier": "{multiplier} moltiplicatore",
	"lap": "{lap} giro",
	"game_ended": "GIOCO FINITO",
	"privacy_policy_title": "Politica sulla Privacy",
	"cookie_policy_title": "Politica sui Cookie",
	"terms_of_use_title": "Termini di Utilizzo",
	"gdpr_title": "Testo GDPR",
	"main_title": "Puzzle delle Bandierine",
	"main_description": "Scopri le bandiere con diversi livelli di difficoltà, scegli la risposta giusta e guadagna il tuo posto nella classifica! Ti aspetta un gioco di quiz sulle bandiere divertente e competitivo!",
	"multiplier_title": "Coefficiente moltiplicativo:",
	"lives_are_over": "LE TUE VITE SONO FINITE",
	"return_the_game": "Ritorna al gioco con una breve pausa pubblicitaria!",
	"watch_ad": "GUARDA LA PUBBLICITÀ",
	"end_game": "FINE DEL GIOCO",
	"hours": "ore",
	"minutes": "minuti",
	"seconds": "secondi",
	"sound_on": "Suono attivato",
	"sound_off": "Suono disattivato",
	"score_saved_successfully": "Punteggio salvato con successo",
	"message_sent_successfully": "Il tuo messaggio è stato inviato con successo",
	"invalid_owner": "Informazioni del proprietario del punteggio non valide",
	"invalid_email": "Indirizzo email non valido",
	"occured_an_error": "Si è verificato un errore",
	"how_to_play": "<h4><span class=\"title-square\"></span>Obiettivo del Gioco:</h4><p>Mettiti alla prova con la tua conoscenza delle bandiere e cerca di ottenere il punteggio più alto! Indovina correttamente il paese delle bandiere che vedi nel gioco e metti il tuo nome nella classifica!</p><br><h4><span class=\"title-square\"></span>Iniziare il Gioco:</h4><p>Seleziona 'Inizia Gioco' dal menu principale.</p><br><h6><span class=\"title-square\"></span>Imposta le impostazioni del gioco:</h6><p><b>Difficoltà:</b> Normale o Difficile<br><b>Numero di Errori:</b> 1, 3 o 5<br><b>Numero di Opzioni:</b> 2, 4 o 6<br><b>Modalità Schermo Intero:</b> Attivato o Disattivato</p><br><h6><span class=\"title-square\"></span>Quando inizia il gioco:</h6><p>In alto a sinistra: Punteggio attuale e moltiplicatore<br>In alto al centro: Countdown di 10 secondi<br>In alto a destra: Numero di errori (icona del cuore)<br>Bottone per disattivare/attivare il suono</p><br><h4><span class=\"title-square\"></span>Sistema di Punteggio:</h4><p>I punti variano in base alle impostazioni selezionate all'inizio del gioco:</p><br><p><b>Difficoltà:</b> Normale (x1.00), Difficile (x1.50)<br><b>Numero di Errori:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Numero di Opzioni:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Moltiplicatore predefinito per ogni round:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Come Vincere il Gioco:</h4><p>Se dai una risposta sbagliata, il tuo conteggio degli errori diminuisce.<br>Se il tempo scade, il gioco finisce.<br>Alla fine del gioco, puoi vedere le tue statistiche e il punteggio.<br>Puoi salvare il tuo punteggio per entrare nella classifica.</p>",
	"cookie_policy": "<h2><span>POLITICA SUI COOKIE</span></h2><br><h4><span class=\"title-square\"></span>Cosa Sono i Cookie?</h4><p>Questo gioco utilizza i cookie per migliorare l'esperienza dell'utente. I cookie sono piccoli file di testo memorizzati sul tuo dispositivo e vengono utilizzati per ricordare le impostazioni del gioco.</p><br><h4><span class=\"title-square\"></span>Quali Cookie Utilizziamo?</h4><h6><span class=\"title-square\"></span>Cookie Essenziali:</h6><p>Utilizziamo localStorage per salvare le impostazioni del suono del gioco.</p><h6><span class=\"title-square\"></span>Cookie di Analisi:</h6><p>Utilizziamo Google Analytics per analizzare come viene giocato il gioco e quali sezioni sono più popolari.</p><h6><span class=\"title-square\"></span>Cookie Pubblicitari:</h6><p>Se utilizziamo Google AdSense nel gioco, i cookie possono essere utilizzati per mostrare annunci personalizzati da Google.</p><br><h4><span class=\"title-square\"></span>Posso Disabilitare i Cookie?</h4><p>Puoi eliminare o bloccare i cookie dalle impostazioni del tuo browser. Tuttavia, alcune funzionalità potrebbero non funzionare correttamente.</p>",
	"privacy_policy": "<h2><span>POLITICA SULLA PRIVACY</span></h2><br><h4><span class=\"title-square\"></span>Quali Dati Raccogliamo?</h4><p>I nomi dei giocatori e i punteggi sono archiviati nella classifica.<br>Salviamo le tue preferenze di gioco (audio acceso/spento, ecc.) nel tuo browser.<br>Analizziamo le prestazioni del gioco utilizzando Google Analytics.</p><br><h4><span class=\"title-square\"></span>Come Vengono Utilizzati i Dati?</h4><p>Per migliorare l'esperienza del giocatore<br>Per creare la classifica<br>Per analizzare le prestazioni del gioco</p><br><h4><span class=\"title-square\"></span>Condividiamo i Dati?</h4><p>I tuoi dati personali non vengono condivisi con terze parti.<br>Tuttavia, poiché utilizziamo Google Analytics, potrebbero essere applicate le politiche sui cookie di Google.</p><br><h4><span class=\"title-square\"></span>Sicurezza dei Dati</h4><p>Non vengono raccolti dati personali eccetto i nomi dei giocatori e i punteggi.<br>I dati sono archiviati e protetti in database criptati.</p>",
	"terms_of_use": "<h2><span>TERMINI DI UTILIZZO</span></h2><br><h4><span class=\"title-square\"></span>1. Utilizzo del Servizio</h4><p>Questo gioco è aperto a tutti ed è gratuito.<br>Giocando, accetti i termini stabiliti qui.</p><br><h4><span class=\"title-square\"></span>2. Registrazione dell'Account e del Punteggio</h4><p>I giocatori devono solo inserire un nome per salvare i loro punteggi.<br>I nomi inseriti sono visibili a tutti.<br>Non è consentito utilizzare nomi offensivi, abusivi o illegali durante il gioco.</p><br><h4><span class=\"title-square\"></span>3. Diritti di Proprietà Intellettuale</h4><p>Il contenuto del gioco (bandiere, grafica, meccaniche) è soggetto a copyright.</p><br><h4><span class=\"title-square\"></span>4. Penali e Risoluzione</h4><p>Se il gioco viene abusato o viene rilevato un inganno, i punteggi degli utenti potrebbero essere eliminati.</p>",
	"gdpr": "<h2><span>PROTEZIONE DEI DATI PERSONALI E POLITICA SULLA PRIVACY</span></h2><br><p>Questo testo di divulgazione è stato preparato in conformità con la Legge sulla Protezione dei Dati Personali n. 6698 (KVKK) e il Regolamento Generale sulla Protezione dei Dati dell'Unione Europea (GDPR). Di seguito troverai informazioni su quali dati personali raccogliamo mentre giochi al nostro gioco, come li trattiamo e come li proteggiamo.</p><br><h4><span class=\"title-square\"></span>1. Chi è il Titolare del Trattamento dei Dati?</h4><p>Questo gioco è gestito da xuibo. Se desideri contattarci riguardo alla protezione dei tuoi dati personali, puoi raggiungerci all'indirizzo <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Quali Dati Personali Trattiamo?</h4><p>Non raccogliamo direttamente dati identificativi mentre giochi al nostro gioco. Tuttavia, possiamo trattare i seguenti dati:</p><br><h6><span class=\"title-square\"></span>Dati Obbligatori (Necessari per l'Esperienza di Gioco)</h6><p>Nome del giocatore (Visibile nella classifica)<br>Statistiche di gioco (Punteggio, numero di risposte corrette/errate, ecc.)<br>Impostazioni audio e visive (Memorizzate utilizzando LocalStorage nel browser)</p><br><h6><span class=\"title-square\"></span>Dati Raccogliati Automaticamente</h6><p>Indirizzo IP e informazioni sul dispositivo (Raccolti in modo anonimo tramite Google Analytics)<br>Informazioni sul browser e sul sistema operativo<br>Dati sull'utilizzo relativi alle prestazioni del gioco (Numero di domande risposte, durata del gioco, ecc.)</p><br><h6><span class=\"title-square\"></span>Cookie e Tecnologie di Tracciamento</h6><p>Il nostro gioco può utilizzare cookie per raccogliere dati anonimi tramite Google Analytics e strumenti simili. Per ulteriori dettagli, consulta la nostra <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Politica sui Cookie</a>.</p><br><h4><span class=\"title-square\"></span>3. Finalità del Trattamento dei Dati Personali</h4><p>Garantire il corretto funzionamento del gioco<br>Creare la classifica e visualizzare il posizionamento dei giocatori<br>Personalizzare l'esperienza di gioco (Silenziare l'audio, preferenze per la modalità schermo intero, ecc.)<br>Analizzare e migliorare le prestazioni del gioco<br>Sicurezza, debug e prevenzione delle frodi<br>Conformità agli obblighi legali</p><br><h4><span class=\"title-square\"></span>4. Condividiamo i Dati Personali?</h4><p>I nomi dei giocatori e i punteggi nella classifica potrebbero essere visualizzati pubblicamente.<br>I dati anonimi vengono analizzati tramite Google Analytics, ma nessun dato personale viene condiviso.<br>I dati potrebbero essere condivisi con le autorità competenti su richiesta legale.</p><br><h4><span class=\"title-square\"></span>5. Base Legale per il Trattamento dei Dati Personali</h4><p>I tuoi dati vengono trattati in conformità con la KVKK e il GDPR sulla base delle seguenti motivazioni legali:<br><br>Adempimento di un contratto (Art. 5/2-c della KVKK, Art. 6/1-b del GDPR) → Garantire il corretto funzionamento del gioco<br>Legittimo interesse (Art. 5/2-f della KVKK, Art. 6/1-f del GDPR) → Analizzare e migliorare l'esperienza di gioco<br>Obblighi legali (Art. 5/2-ç della KVKK, Art. 6/1-c del GDPR) → Rispondere alle richieste ufficiali delle autorità</p><br><h4><span class=\"title-square\"></span>6. Quanto Tempo Conserviamo i Tuoi Dati?</h4><p>I nomi dei giocatori e i punteggi nella classifica potrebbero essere conservati indefinitamente. Tuttavia, i giocatori possono richiedere la cancellazione dei propri dati.<br>I dati di Google Analytics sono anonimizzati e cancellati automaticamente dopo un certo periodo.<br>Le impostazioni locali del browser (LocalStorage) vengono conservate fino alla chiusura del browser o alla cancellazione manuale da parte dell'utente.</p><br><h4><span class=\"title-square\"></span>7. I Tuoi Diritti sotto la KVKK e il GDPR</h4><p>Sotto la KVKK e il GDPR, hai i seguenti diritti:<br><br>- Sapere se i tuoi dati sono trattati<br>- Comprendere lo scopo del trattamento e come vengono utilizzati<br>- Richiedere la correzione se i dati sono trattati in modo errato o incompleto<br>- Richiedere la cancellazione o anonimizzazione dei tuoi dati<br>- Essere informato se i tuoi dati trattati vengono condivisi con terze parti<br>- Richiedere un risarcimento se il trattamento è illecito e causa danni</p><br><p>Per esercitare questi diritti, puoi contattarci all'indirizzo <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Diritti Aggiuntivi del GDPR (Per gli Utenti UE)</h4><p>- Diritto alla Portabilità dei Dati: Se richiesto, possiamo trasferire i tuoi dati a te o a un altro fornitore di servizi.<br>- Diritto di Opporsi alla Decisione Automatica: Puoi opporsi alla valutazione dei tuoi dati da parte di sistemi automatizzati.<br>- Diritto di Revocare il Consenso: Se i tuoi dati sono trattati in base al tuo consenso, puoi revocarlo in qualsiasi momento.</p><br><h4><span class=\"title-square\"></span>9. Politica sui Cookie e Opzioni di Consenso</h4><p>Il nostro gioco utilizza i cookie per migliorare l'esperienza di gioco. In conformità con le leggi GDPR applicabili nell'Unione Europea, potrebbe essere richiesto il tuo consenso per l'uso dei cookie. Se desideri disabilitare i cookie, puoi farlo nelle impostazioni del tuo browser.</p><br><p>Per ulteriori dettagli, visita la nostra pagina <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Politica sui Cookie</a>.</p><br><h4><span class=\"title-square\"></span>10. Aggiornamenti e Modifiche</h4><p>Questa politica sulla privacy può essere aggiornata di tanto in tanto. Ti informeremo di eventuali modifiche significative tramite il nostro sito web o all'interno del gioco.</p><br><p>Ultimo aggiornamento: 17.03.2025</p>"
}