{
	"start_game": "STARTEN",
	"leaderboard": "LEIDERSCHAP",
	"how_to_play_title": "HOE TE SPELEN?",
	"contact_title": "CONTACT",
	"game_settings": "GAME-INSTELLINGEN",
	"game_difficulty": "Moeilijkheidsgraad",
	"game_difficulty_normal": "Normaal",
	"game_difficulty_hard": "Moeilijk",
	"game_number_of_fault": "Aantal Fouten",
	"game_options_amount": "Opties",
	"spent_time": "Bestede Tijd",
	"laps_amount": "Aantal Ronden",
	"play_again": "WEER SPELEN",
	"save": "OPSLAAN",
	"send": "VERZENDEN",
	"save_score": "SCORE OPSLAAN",
	"score_owner": "Score Eigenaar",
	"email_address": "E-mailadres",
	"message": "Jouw Bericht",
	"go_back": "GA TERUG",
	"be_ready": "WEES KLAAR",
	"hard": "MOEILIJK",
	"full_screen_mode_title": "Volledig Scherm Modus",
	"full_screen_mode_desc": "Aanbevolen voor een betere game-ervaring",
	"no_record": "Geen records hier",
	"global": "WERELDWIJD",
	"points": "{points} punten",
	"multiplier": "{multiplier} vermenigvuldiger",
	"lap": "{lap} ronde",
	"game_ended": "SPEL GEËINDIGD",
	"privacy_policy_title": "Privacybeleid",
	"cookie_policy_title": "Cookiebeleid",
	"terms_of_use_title": "Gebruiksvoorwaarden",
	"gdpr_title": "GDPR Tekst",
	"main_title": "Vlag Puzzel",
	"main_description": "Ontdek vlaggen met verschillende moeilijkheidsgraden, kies het juiste antwoord en verdien je plek op het leaderboard! Een leuk en competitief vlaggenquizspel wacht op je!",
	"multiplier_title": "Vermenigvuldiger:",
	"lives_are_over": "JE LEVENS ZIJN OP",
	"return_the_game": "Keer terug naar het spel na een korte reclamepauze!",
	"watch_ad": "KIJK NAAR RECLAME",
	"end_game": "EINDE VAN HET SPEL",
	"hours": "uren",
	"minutes": "minuten",
	"seconds": "seconden",
	"sound_on": "Geluid aan",
	"sound_off": "Geluid uit",
	"score_saved_successfully": "Score succesvol opgeslagen",
	"message_sent_successfully": "Je bericht is succesvol verzonden",
	"invalid_owner": "Ongeldige score eigenaar informatie",
	"invalid_email": "Ongeldig e-mailadres",
	"occured_an_error": "Er is een fout opgetreden",
	"how_to_play": "<h4><span class=\"title-square\"></span>Doel van het spel:</h4><p>Test je vlaggenkennis en probeer de hoogste score te behalen! Raad het land van de vlaggen die je in het spel ziet correct en zet je naam op de leiderschapslijst!</p><br><h4><span class=\"title-square\"></span>Het spel starten:</h4><p>Kies 'Start Game' uit het hoofdmenu.</p><br><h6><span class=\"title-square\"></span>Stel de game-instellingen in:</h6><p><b>Moeilijkheidsgraad:</b> Normaal of Moeilijk<br><b>Aantal Fouten:</b> 1, 3 of 5<br><b>Aantal Opties:</b> 2, 4 of 6<br><b>Volledig Scherm:</b> Aan of Uit</p><br><h6><span class=\"title-square\"></span>Wanneer het spel begint:</h6><p>Boven links: Huidige score en vermenigvuldiger<br>Boven midden: 10 seconden aftelling<br>Boven rechts: Aantal fouten (harticoon)<br>Stilte-aan/uit knop</p><br><h4><span class=\"title-square\"></span>Scoresysteem:</h4><p>De punten variëren op basis van de geselecteerde instellingen aan het begin van het spel:</p><br><p><b>Moeilijkheidsgraad:</b> Normaal (x1.00), Moeilijk (x1.50)<br><b>Aantal Fouten:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Aantal Opties:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Standaard vermenigvuldiger per ronde:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Hoe het spel te winnen:</h4><p>Als je een fout antwoord geeft, wordt je foutenaantal verlaagd.<br>Als de tijd om is, eindigt het spel.<br>Aan het einde van het spel kun je je statistieken en score zien.<br>Je kunt je score opslaan om deel te nemen aan de leiderschapslijst.</p>",
	"cookie_policy": "<h2><span>COOKIEBELEID</span></h2><br><h4><span class=\"title-square\"></span>Wat zijn Cookies?</h4><p>Dit spel gebruikt cookies om de gebruikerservaring te verbeteren. Cookies zijn kleine tekstbestanden die op je apparaat worden opgeslagen en worden gebruikt om je game-instellingen te onthouden.</p><br><h4><span class=\"title-square\"></span>Welke Cookies Gebruiken Wij?</h4><h6><span class=\"title-square\"></span>Essentiële Cookies:</h6><p>We gebruiken localStorage om de geluidsinstellingen van het spel op te slaan.</p><h6><span class=\"title-square\"></span>Analytics Cookies:</h6><p>We gebruiken Google Analytics om te analyseren hoe het spel wordt gespeeld en welke secties populairder zijn.</p><h6><span class=\"title-square\"></span>Advertentie Cookies:</h6><p>Als we Google AdSense in het spel gebruiken, kunnen cookies worden gebruikt om gepersonaliseerde advertenties door Google weer te geven.</p><br><h4><span class=\"title-square\"></span>Kan ik Cookies Uitschakelen?</h4><p>Je kunt cookies verwijderen of blokkeren via je browserinstellingen. Sommige functies werken echter mogelijk niet goed.</p>",
	"privacy_policy": "<h2><span>PRIVACY POLICY</span></h2><br><h4><span class=\"title-square\"></span>Welke gegevens verzamelen we?</h4><p>Speler namen en scores worden opgeslagen in de ranglijst.<br>We slaan je voorkeuren in het spel (geluid aan/uit, etc.) op in je browser.<br>We analyseren de gameprestaties met Google Analytics.</p><br><h4><span class=\"title-square\"></span>Hoe wordt de gegevens gebruikt?</h4><p>Om de spelerservaring te verbeteren<br>Om de ranglijst te maken<br>Om de prestaties van het spel te analyseren</p><br><h4><span class=\"title-square\"></span>Deel je gegevens met anderen?</h4><p>Je persoonlijke gegevens worden niet gedeeld met derden.<br>Omdat we Google Analytics gebruiken, kunnen de cookiebeleidsregels van Google van toepassing zijn.</p><br><h4><span class=\"title-square\"></span>Gegevensbeveiliging</h4><p>Er worden geen persoonlijke gegevens verzameld, behalve de naam en scores van de speler.<br>Gegevens worden opgeslagen en beschermd in versleutelde databases.</p>",
	"terms_of_use": "<h2><span>TERMS OF USE</span></h2><br><h4><span class=\"title-square\"></span>1. Gebruik van de dienst</h4><p>Dit spel is open voor iedereen en gratis te spelen.<br>Door het spel te spelen, ga je akkoord met de hier vermelde voorwaarden.</p><br><h4><span class=\"title-square\"></span>2. Account- en scoreregistratie</h4><p>Spelers moeten alleen een naam invoeren om hun scores op te slaan.<br>De ingevoerde namen zijn zichtbaar voor iedereen.<br>Spelers mogen geen aanstootgevende, beledigende of illegale namen gebruiken tijdens het spel.</p><br><h4><span class=\"title-square\"></span>3. Intellectuele eigendomsrechten</h4><p>De inhoud van het spel (vlaggen, graphics, mechanismen) is onderhevig aan auteursrecht.</p><br><h4><span class=\"title-square\"></span>4. Straffen en beëindiging</h4><p>Als het spel misbruikt wordt of als er vals wordt gespeeld, kunnen de scores van gebruikers worden verwijderd.</p>",
	"gdpr": "<h2><span>PERSONAL DATA PROTECTION AND PRIVACY POLICY</span></h2><br><p>Deze openbaarmakingstekst is opgesteld in overeenstemming met de Wet Bescherming Persoonsgegevens nr. 6698 (KVKK) en de Algemene Verordening Gegevensbescherming (AVG) van de Europese Unie. Hieronder vindt u informatie over welke persoonsgegevens we verzamelen terwijl u ons spel speelt, hoe we deze verwerken en hoe we ze beschermen.</p><br><h4><span class=\"title-square\"></span>1. Wie is de Gegevensbeheerder?</h4><p>Dit spel wordt beheerd door xuibo. Als u contact met ons wilt opnemen met betrekking tot de bescherming van uw persoonsgegevens, kunt u ons bereiken via <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Welke Persoonsgegevens Verwerken Wij?</h4><p>We verzamelen geen identiteitsgegevens terwijl u ons spel speelt. We kunnen echter de volgende gegevens verwerken:</p><br><h6><span class=\"title-square\"></span>Verplichte Gegevens (Nodig voor de Game-ervaring)</h6><p>Speler naam (weergegeven op de ranglijst)<br>Game-statistieken (score, aantal juiste/foute antwoorden, etc.)<br>Geluid- en visuele instellingen (opgeslagen via LocalStorage in de browser)</p><br><h6><span class=\"title-square\"></span>Automatisch Verzamelde Gegevens</h6><p>IP-adres en apparaatinformatie (anoniem verzameld via Google Analytics)<br>Informatie over browser en besturingssysteem<br>Gebruik van gegevens met betrekking tot gameprestaties (aantal beantwoorde vragen, speltijd, etc.)</p><br><h6><span class=\"title-square\"></span>Cookies en Trackingtechnologieën</h6><p>Ons spel kan cookies gebruiken om anonieme gegevens te verzamelen via Google Analytics en soortgelijke tools. Voor meer details kunt u ons <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Cookiebeleid</a> raadplegen.</p><br><h4><span class=\"title-square\"></span>3. Doelen van het Verwerken van Persoonsgegevens</h4><p>Het waarborgen van de goede werking van het spel<br>Het maken van de ranglijst en het weergeven van spelersranglijsten<br>Het personaliseren van de game-ervaring (geluid dempen, voorkeur voor volledig scherm, etc.)<br>Het analyseren en verbeteren van de gameprestaties<br>Beveiliging, foutopsporing en fraude-preventie<br>Naleving van wettelijke verplichtingen</p><br><h4><span class=\"title-square\"></span>4. Met Wie Delen Wij Persoonsgegevens?</h4><p>Speler namen en scores op de ranglijst kunnen openbaar worden weergegeven.<br>Anonieme gegevens worden geanalyseerd via Google Analytics, maar er worden geen persoonlijke gegevens gedeeld.<br>Gegevens kunnen worden gedeeld met bevoegde autoriteiten op basis van wettelijke verzoeken.</p><br><h4><span class=\"title-square\"></span>5. Wettelijke Grondslag voor het Verwerken van Persoonsgegevens</h4><p>Uw gegevens worden verwerkt in overeenstemming met de KVKK en de AVG op basis van de volgende wettelijke gronden:<br><br>Vervulling van een contract (KVKK Art.5/2-c, AVG Art.6/1-b) → Het waarborgen van de goede werking van het spel<br>Legitiem belang (KVKK Art.5/2-f, AVG Art.6/1-f) → Het analyseren en verbeteren van de game-ervaring<br>Wettelijke verplichtingen (KVKK Art.5/2-ç, AVG Art.6/1-c) → Reageren op officiële verzoeken van autoriteiten</p><br><h4><span class=\"title-square\"></span>6. Hoe Lang Bewaren We Uw Gegevens?</h4><p>Speler namen en scores op de ranglijst kunnen voor onbepaalde tijd worden opgeslagen. Spelers kunnen echter verzoeken om hun gegevens te verwijderen.<br>Google Analytics-gegevens worden geanonimiseerd en automatisch verwijderd na een bepaalde periode.<br>Lokale browserinstellingen (LocalStorage) worden opgeslagen totdat de browser wordt gesloten of de gebruiker ze handmatig verwijdert.</p><br><h4><span class=\"title-square\"></span>7. Uw Rechten Onder de KVKK en AVG</h4><p>Onder de KVKK en AVG heeft u de volgende rechten:<br><br>- Om te leren of uw gegevens worden verwerkt<br>- Om het doel van de verwerking te begrijpen en hoe deze wordt gebruikt<br>- Om correctie aan te vragen als gegevens onjuist of onvolledig worden verwerkt<br>- Om het verwijderen of anonimiseren van uw gegevens aan te vragen<br>- Om geïnformeerd te worden als uw verwerkte gegevens met derden worden gedeeld<br>- Om compensatie aan te vragen als de verwerking onwettig is en schade veroorzaakt</p><br><p>Om deze rechten uit te oefenen, kunt u contact met ons opnemen via <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Aanvullende AVG-rechten (Voor EU-gebruikers)</h4><p>- Recht op Gegevensportabiliteit: Indien gewenst kunnen we uw gegevens naar u of een andere dienstverlener overdragen.<br>- Recht om bezwaar te maken tegen geautomatiseerde besluitvorming: U kunt bezwaar maken tegen de evaluatie van uw gegevens door geautomatiseerde systemen.<br>- Recht om toestemming in te trekken: Als uw gegevens worden verwerkt op basis van uw toestemming, kunt u deze toestemming op elk moment intrekken.</p><br><h4><span class=\"title-square\"></span>9. Cookiebeleid en Toestemmingsopties</h4><p>Ons spel gebruikt cookies om de game-ervaring te verbeteren. In overeenstemming met de AVG-wetgeving die van toepassing is in de Europese Unie, kan uw toestemming vereist zijn voor het gebruik van cookies. Als u cookies wilt uitschakelen, kunt u dit doen in de instellingen van uw browser.</p><br><p>Voor meer details kunt u onze <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Cookie Policy</a> pagina bezoeken.</p><br><h4><span class=\"title-square\"></span>10. Updates en Wijzigingen</h4><p>Deze privacybeleid kan van tijd tot tijd worden bijgewerkt. We zullen u op de hoogte stellen van belangrijke wijzigingen via onze website of binnen het spel.</p><br><p>Laatste update: 17.03.2025</p>",
}
