{
	"start_game": "INICIAR JOGO",
	"leaderboard": "CLASSIFICAÇÃO",
	"how_to_play_title": "COMO JOGAR?",
	"contact_title": "CONTATO",
	"game_settings": "CONFIGURAÇÕES DO JOGO",
	"game_difficulty": "Dificuldade",
	"game_difficulty_normal": "Normal",
	"game_difficulty_hard": "Difícil",
	"game_number_of_fault": "Número de Erros",
	"game_options_amount": "Opções",
	"spent_time": "Tempo Gasto",
	"laps_amount": "Número de Voltas",
	"play_again": "JOGAR NOVAMENTE",
	"save": "SALVAR",
	"send": "ENVIAR",
	"save_score": "SALVAR PONTUAÇÃO",
	"score_owner": "Proprietário da Pontuação",
	"email_address": "Endereço de E-mail",
	"message": "Sua Mensagem",
	"go_back": "VOLTAR",
	"be_ready": "FIQUE PRONTO",
	"hard": "DIFÍCIL",
	"full_screen_mode_title": "Modo de Tela Cheia",
	"full_screen_mode_desc": "Recomendado para uma melhor experiência de jogo",
	"no_record": "Sem registros aqui",
	"global": "GLOBAL",
	"points": "{points} pontos",
	"multiplier": "{multiplier} multiplicador",
	"lap": "{lap} volta",
	"game_ended": "FIM DE JOGO",
	"privacy_policy_title": "Política de Privacidade",
	"cookie_policy_title": "Política de Cookies",
	"terms_of_use_title": "Termos de Uso",
	"gdpr_title": "Texto GDPR",
	"main_title": "Quebra-Cabeça de Bandeiras",
	"main_description": "Descubra as bandeiras com diferentes níveis de dificuldade, escolha a resposta certa e ganhe seu lugar no ranking! Um divertido e competitivo jogo de perguntas e respostas sobre bandeiras está esperando por você!",
	"multiplier_title": "Coeficiente multiplicador:",
	"lives_are_over": "SUAS VIDAS ACABARAM",
	"return_the_game": "Volte para o jogo com uma curta pausa para anúncio!",
	"watch_ad": "ASSISTIR ANÚNCIO",
	"end_game": "ENCERRAR JOGO",
	"hours": "horas",
	"minutes": "minutos",
	"seconds": "segundos",
	"sound_on": "Som ligado",
	"sound_off": "Som desligado",
	"score_saved_successfully": "Pontuação salva com sucesso",
	"message_sent_successfully": "Sua mensagem foi enviada com sucesso",
	"invalid_owner": "Informações do proprietário da pontuação inválidas",
	"invalid_email": "Endereço de e-mail inválido",
	"occured_an_error": "Ocorreu um erro",
	"how_to_play": "<h4><span class=\"title-square\"></span>Objetivo do Jogo:</h4><p>Teste seus conhecimentos sobre bandeiras e tente marcar a maior pontuação! Adivinhe corretamente o país das bandeiras que aparecerem no jogo e coloque seu nome na classificação!</p><br><h4><span class=\"title-square\"></span>Iniciando o Jogo:</h4><p>Selecione 'Iniciar Jogo' no menu principal.</p><br><h6><span class=\"title-square\"></span>Defina as configurações do jogo:</h6><p><b>Dificuldade:</b> Normal ou Difícil<br><b>Número de Erros:</b> 1, 3 ou 5<br><b>Número de Opções:</b> 2, 4 ou 6<br><b>Modo de Tela Cheia:</b> Ativado ou Desativado</p><br><h6><span class=\"title-square\"></span>Quando o jogo começa:</h6><p>Topo esquerdo: Pontuação atual e multiplicador<br>Topo centro: Contagem regressiva de 10 segundos<br>Topo direito: Número de erros (ícone de coração)<br>Botão de silenciar/desmutar</p><br><h4><span class=\"title-square\"></span>Sistema de Pontuação:</h4><p>A pontuação varia de acordo com as configurações selecionadas no início do jogo:</p><br><p><b>Dificuldade:</b> Normal (x1.00), Difícil (x1.50)<br><b>Número de Erros:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Número de Opções:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Multiplicador padrão por rodada:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Como Vencer o Jogo:</h4><p>Se você der uma resposta errada, a contagem de erros diminui.<br>Se o tempo acabar, o jogo termina.<br>No final do jogo, você pode ver suas estatísticas e pontuação.<br>Você pode salvar sua pontuação para entrar na classificação.</p>",
	"cookie_policy": "<h2><span>POLÍTICA DE COOKIES</span></h2><br><h4><span class=\"title-square\"></span>O que são Cookies?</h4><p>Este jogo usa cookies para melhorar a experiência do usuário. Cookies são pequenos arquivos de texto armazenados no seu dispositivo e são usados para lembrar as configurações do seu jogo.</p><br><h4><span class=\"title-square\"></span>Quais Cookies Usamos?</h4><h6><span class=\"title-square\"></span>Cookies Essenciais:</h6><p>Usamos localStorage para salvar as configurações de som do jogo.</p><h6><span class=\"title-square\"></span>Cookies de Análise:</h6><p>Usamos o Google Analytics para analisar como o jogo é jogado e quais seções são mais populares.</p><h6><span class=\"title-square\"></span>Cookies de Publicidade:</h6><p>Se usarmos o Google AdSense no jogo, os cookies podem ser usados para exibir anúncios personalizados pelo Google.</p><br><h4><span class=\"title-square\"></span>Posso Desativar os Cookies?</h4><p>Você pode excluir ou bloquear cookies nas configurações do seu navegador. No entanto, alguns recursos podem não funcionar corretamente.</p>",
	"privacy_policy": "<h2><span>POLÍTICA DE PRIVACIDADE</span></h2><br><h4><span class=\"title-square\"></span>Quais Dados Coletamos?</h4><p>Os nomes dos jogadores e as pontuações são armazenados no placar.<br>Salvamos suas preferências no jogo (som ligado/desligado, etc.) no seu navegador.<br>Analisamos o desempenho do jogo usando o Google Analytics.</p><br><h4><span class=\"title-square\"></span>Como Os Dados São Usados?</h4><p>Para melhorar a experiência do jogador<br>Para criar o placar<br>Para analisar o desempenho do jogo</p><br><h4><span class=\"title-square\"></span>Compartilhamos Dados?</h4><p>Seus dados pessoais não são compartilhados com terceiros.<br>No entanto, como usamos o Google Analytics, as políticas de cookies do Google podem ser aplicáveis.</p><br><h4><span class=\"title-square\"></span>Segurança dos Dados</h4><p>Nenhum dado pessoal é coletado, exceto os nomes dos jogadores e as pontuações.<br>Os dados são armazenados e protegidos em bancos de dados criptografados.</p>",
	"terms_of_use": "<h2><span>TERMOS DE USO</span></h2><br><h4><span class=\"title-square\"></span>1. Uso do Serviço</h4><p>Este jogo está aberto para todos e é gratuito para jogar.<br>Ao jogar, você concorda com os termos aqui estabelecidos.</p><br><h4><span class=\"title-square\"></span>2. Registro de Conta e Pontuação</h4><p>Os jogadores precisam apenas inserir um nome para salvar suas pontuações.<br>Os nomes inseridos são visíveis para todos.<br>Os jogadores não podem usar nomes ofensivos, abusivos ou ilegais durante o jogo.</p><br><h4><span class=\"title-square\"></span>3. Direitos de Propriedade Intelectual</h4><p>O conteúdo do jogo (bandeiras, gráficos, mecânicas) é protegido por direitos autorais.</p><br><h4><span class=\"title-square\"></span>4. Penalidades e Término</h4><p>Se o jogo for mal utilizado ou se for detectada trapaça, as pontuações dos usuários poderão ser excluídas.</p>",
	"gdpr": "<h2><span>POLÍTICA DE PROTEÇÃO DE DADOS PESSOAIS E PRIVACIDADE</span></h2><br><p>Este texto de divulgação foi preparado de acordo com a Lei de Proteção de Dados Pessoais nº 6698 (KVKK) e o Regulamento Geral de Proteção de Dados da União Europeia (GDPR). Abaixo, você encontrará informações sobre quais dados pessoais coletamos enquanto você joga nosso jogo, como os processamos e como os protegemos.</p><br><h4><span class=\"title-square\"></span>1. Quem é o Controlador de Dados?</h4><p>Este jogo é operado pela xuibo. Se você deseja entrar em contato conosco sobre a proteção de seus dados pessoais, pode nos contatar em <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Quais Dados Pessoais Processamos?</h4><p>Não coletamos diretamente dados de identidade enquanto você joga nosso jogo. No entanto, podemos processar os seguintes dados:</p><br><h6><span class=\"title-square\"></span>Dados Obrigatórios (Necessários para a Experiência do Jogo)</h6><p>Nome do jogador (Exibido no placar)<br>Estatísticas do jogo (Pontuação, número de respostas corretas/incorretas, etc.)<br>Configurações de som e vídeo (Armazenado usando LocalStorage no navegador)</p><br><h6><span class=\"title-square\"></span>Dados Coletados Automaticamente</h6><p>Endereço IP e informações do dispositivo (Coletados anonimamente via Google Analytics)<br>Informações sobre o navegador e sistema operacional<br>Dados de uso relacionados ao desempenho do jogo (Número de perguntas respondidas, duração do jogo, etc.)</p><br><h6><span class=\"title-square\"></span>Cookies e Tecnologias de Rastreamento</h6><p>Nosso jogo pode usar cookies para coletar dados anônimos por meio do Google Analytics e ferramentas similares. Para mais detalhes, consulte nossa <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Política de Cookies</a>.</p><br><h4><span class=\"title-square\"></span>3. Finalidades do Processamento de Dados Pessoais</h4><p>Garantir o funcionamento adequado do jogo<br>Criar o placar e exibir as classificações dos jogadores<br>Personalizar a experiência no jogo (Silenciamento do som, preferência por tela cheia, etc.)<br>Analisar e melhorar o desempenho do jogo<br>Segurança, depuração e prevenção de fraudes<br>Conformidade com obrigações legais</p><br><h4><span class=\"title-square\"></span>4. Com Quem Compartilhamos Dados Pessoais?</h4><p>Os nomes dos jogadores e as pontuações no placar podem ser exibidos publicamente.<br>Dados anônimos são analisados via Google Analytics, mas nenhum dado pessoal é compartilhado.<br>Os dados podem ser compartilhados com autoridades autorizadas mediante solicitações legais.</p><br><h4><span class=\"title-square\"></span>5. Base Legal para Processamento de Dados Pessoais</h4><p>Seus dados são processados em conformidade com a KVKK e o GDPR com base nos seguintes fundamentos legais:<br><br>Execução de um contrato (KVKK Art.5/2-c, GDPR Art.6/1-b) → Garantir o funcionamento adequado do jogo<br>Interesse legítimo (KVKK Art.5/2-f, GDPR Art.6/1-f) → Analisar e melhorar a experiência no jogo<br>Obrigações legais (KVKK Art.5/2-ç, GDPR Art.6/1-c) → Responder a solicitações oficiais das autoridades</p><br><h4><span class=\"title-square\"></span>6. Por Quanto Tempo Retemos Seus Dados?</h4><p>Os nomes dos jogadores e as pontuações no placar podem ser armazenados indefinidamente. No entanto, os jogadores podem solicitar a exclusão de seus dados.<br>Os dados do Google Analytics são anonimizados e excluídos automaticamente após um determinado período.<br>As configurações locais do navegador (LocalStorage) são armazenadas até o navegador ser fechado ou o usuário excluí-las manualmente.</p><br><h4><span class=\"title-square\"></span>7. Seus Direitos sob a KVKK e GDPR</h4><p>De acordo com a KVKK e o GDPR, você tem os seguintes direitos:<br><br>- Saber se seus dados estão sendo processados<br>- Compreender a finalidade do processamento e como estão sendo usados<br>- Solicitar correção caso os dados sejam processados de forma incorreta ou incompleta<br>- Solicitar a exclusão ou anonimização dos seus dados<br>- Ser informado se seus dados processados forem compartilhados com terceiros<br>- Solicitar compensação se o processamento for ilegal e resultar em danos</p><br><p>Para exercer esses direitos, você pode entrar em contato conosco em <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Direitos Adicionais do GDPR (Para Usuários da UE)</h4><p>- Direito à Portabilidade dos Dados: Se solicitado, podemos transferir seus dados para você ou outro provedor de serviços.<br>- Direito de Objeção à Tomada de Decisões Automatizadas: Você pode se opor à avaliação dos seus dados por sistemas automatizados.<br>- Direito de Retirar o Consentimento: Se seus dados forem processados com base no seu consentimento, você pode retirar seu consentimento a qualquer momento.</p><br><h4><span class=\"title-square\"></span>9. Política de Cookies e Opções de Consentimento</h4><p>Nosso jogo usa cookies para melhorar a experiência de jogo. De acordo com as leis do GDPR aplicáveis na União Europeia, seu consentimento pode ser necessário para o uso de cookies. Se você deseja desativar os cookies, pode fazê-lo nas configurações do seu navegador.</p><br><p>Para mais detalhes, visite nossa página de <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Política de Cookies</a>.</p><br><h4><span class=\"title-square\"></span>10. Atualizações e Alterações</h4><p>Esta política de privacidade pode ser atualizada periodicamente. Notificaremos você sobre mudanças significativas por meio de nosso site ou dentro do jogo.</p><br><p>Última Atualização: 17.03.2025</p>"
}