{
	"start_game": "ÎNCEPE",
	"leaderboard": "CLASAMENT",
	"how_to_play_title": "CUM SE JOCĂ?",
	"contact_title": "CONTACT",
	"game_settings": "SETĂRI JOC",
	"game_difficulty": "Dificultate",
	"game_difficulty_normal": "Normal",
	"game_difficulty_hard": "Dificil",
	"game_number_of_fault": "Număr de greșeli",
	"game_options_amount": "Opțiuni",
	"spent_time": "Timp petrecut",
	"laps_amount": "Număr de ture",
	"play_again": "JOACĂ DIN NOU",
	"save": "SALVEAZĂ",
	"send": "TRIMITE",
	"save_score": "SALVEAZĂ SCORUL",
	"score_owner": "Proprietar scor",
	"email_address": "Adresă de email",
	"message": "Mesajul tău",
	"go_back": "ÎNTORCE-TE",
	"be_ready": "FII GATA",
	"hard": "DIFICIL",
	"full_screen_mode_title": "Mod ecran complet",
	"full_screen_mode_desc": "Recomandat pentru o experiență de joc mai bună",
	"no_record": "Nu sunt înregistrări aici",
	"global": "GLOBAL",
	"points": "{points} puncte",
	"multiplier": "{multiplier} multiplicator",
	"lap": "{lap} tură",
	"game_ended": "JOC TERMINAT",
	"privacy_policy_title": "Politica de confidențialitate",
	"cookie_policy_title": "Politica de cookies",
	"terms_of_use_title": "Termeni și condiții",
	"gdpr_title": "Text GDPR",
	"main_title": "Puzzle cu Steaguri",
	"main_description": "Descoperă steaguri cu nivele diferite de dificultate, alege răspunsul corect și câștigă-ți locul în clasament! Un joc de quiz despre steaguri, amuzant și competitiv, te așteaptă!",
	"multiplier_title": "Coeficientul de multiplicare:",
	"lives_are_over": "VIEȚILE TALE S-AU TERMINAT",
	"return_the_game": "Întoarce-te la joc după o scurtă pauză publicitară!",
	"watch_ad": "VEZI RECLAMĂ",
	"end_game": "ÎNCHEIE JOCUL",
	"hours": "ore",
	"minutes": "minute",
	"seconds": "secunde",
	"sound_on": "Sunet activat",
	"sound_off": "Sunet oprit",
	"score_saved_successfully": "Scor salvat cu succes",
	"message_sent_successfully": "Mesajul a fost trimis cu succes",
	"invalid_owner": "Informații invalide ale proprietarului scorului",
	"invalid_email": "Adresă de e-mail invalidă",
	"occured_an_error": "A apărut o eroare",
	"how_to_play": "<h4><span class=\"title-square\"></span>Obiectivul jocului:</h4><p>Testează-ți cunoștințele despre steaguri și încearcă să obții cel mai mare scor! Ghicește corect țara steagurilor pe care le vezi în joc și pune-ți numele în clasament!</p><br><h4><span class=\"title-square\"></span>Începerea jocului:</h4><p>Selectează 'Începe Jocul' din meniul principal.</p><br><h6><span class=\"title-square\"></span>Setează opțiunile jocului:</h6><p><b>Dificultate:</b> Normal sau Dificil<br><b>Număr de greșeli:</b> 1, 3 sau 5<br><b>Număr de opțiuni:</b> 2, 4 sau 6<br><b>Mod ecran complet:</b> Activat sau Deactivat</p><br><h6><span class=\"title-square\"></span>Când începe jocul:</h6><p>Sus stânga: Scorul curent și multiplicatorul<br>Sus centru: Contor de 10 secunde<br>Sus dreapta: Numărul de greșeli (iconița inimii)<br>Buton de mute/urmărește sunetul</p><br><h4><span class=\"title-square\"></span>Sistemul de punctaj:</h4><p>Punctele variază în funcție de setările selectate la începutul jocului:</p><br><p><b>Dificultate:</b> Normal (x1.00), Dificil (x1.50)<br><b>Număr de greșeli:</b> 1 (x1.50), 3 (x1.00), 5 (x0.50)<br><b>Număr de opțiuni:</b> 2 (x0.50), 4 (x1.00), 6 (x1.50)<br><b>Multiplicator implicit pe rundă:</b> x1.00</p><br><h4><span class=\"title-square\"></span>Cum să câștigi jocul:</h4><p>Dacă dai un răspuns greșit, numărul tău de greșeli scade.<br>Dacă timpul se termină, jocul se încheie.<br>La sfârșitul jocului, poți vedea statisticile și scorul tău.<br>Poți salva scorul pentru a intra în clasament.</p>",
	"cookie_policy": "<h2><span>POLITICA DE COOKIES</span></h2><br><h4><span class=\"title-square\"></span>Ce sunt cookies?</h4><p>Acest joc utilizează cookies pentru a îmbunătăți experiența utilizatorului. Cookies sunt fișiere mici de text stocate pe dispozitivul tău și sunt folosite pentru a-ți aminti setările jocului.</p><br><h4><span class=\"title-square\"></span>Ce cookies folosim?</h4><h6><span class=\"title-square\"></span>Cookies esențiale:</h6><p>Folosim localStorage pentru a salva setările sunetului din joc.</p><h6><span class=\"title-square\"></span>Cookies de analiză:</h6><p>Folosim Google Analytics pentru a analiza modul în care este jucat jocul și care secțiuni sunt cele mai populare.</p><h6><span class=\"title-square\"></span>Cookies publicitare:</h6><p>Dacă utilizăm Google AdSense în joc, cookies pot fi folosite pentru a afișa reclame personalizate de către Google.</p><br><h4><span class=\"title-square\"></span>Pot dezactiva cookies?</h4><p>Poți șterge sau bloca cookies din setările browserului tău. Totuși, unele funcții ar putea să nu funcționeze corect.</p>",
	"privacy_policy": "<h2><span>POLITICA DE CONFIDENȚIALITATE</span></h2><br><h4><span class=\"title-square\"></span>Ce date colectăm?</h4><p>Numele jucătorilor și scorurile sunt stocate în clasament.<br>Salvăm preferințele tale din joc (sunet activat/dezactivat, etc.) în browserul tău.<br>Analizăm performanța jocului folosind Google Analytics.</p><br><h4><span class=\"title-square\"></span>Cum sunt folosite datele?</h4><p>Pentru a îmbunătăți experiența jucătorului<br>Pentru a crea clasamentul<br>Pentru a analiza performanța jocului</p><br><h4><span class=\"title-square\"></span>Partajăm datele?</h4><p>Datele tale personale nu sunt partajate cu terțe părți.<br>Totuși, deoarece folosim Google Analytics, politicile de cookie ale Google pot aplica.</p><br><h4><span class=\"title-square\"></span>Securitatea datelor</h4><p>Nu se colectează date personale, cu excepția numelui și scorurilor jucătorilor.<br>Datele sunt stocate și protejate în baze de date criptate.</p>",
	"terms_of_use": "<h2><span>TERMENII DE UTILIZARE</span></h2><br><h4><span class=\"title-square\"></span>1. Utilizarea serviciului</h4><p>Acest joc este deschis tuturor și gratuit pentru a fi jucat.<br>Prin jocul jocului, ești de acord cu termenii stabiliți aici.</p><br><h4><span class=\"title-square\"></span>2. Înregistrarea contului și scorului</h4><p>Jucătorii trebuie doar să introducă un nume pentru a-și salva scorurile.<br>Numerele introduse sunt vizibile tuturor.<br>Jucătorii nu au voie să folosească nume ofensatoare, abuzive sau ilegale în timpul jocului.</p><br><h4><span class=\"title-square\"></span>3. Drepturi de proprietate intelectuală</h4><p>Conținutul jocului (steaguri, grafice, mecanici) este protejat prin drepturi de autor.</p><br><h4><span class=\"title-square\"></span>4. Penalități și încetarea serviciului</h4><p>Dacă jocul este utilizat incorect sau se detectează trucarea, scorurile utilizatorilor pot fi șterse.</p>",
	"gdpr": "<h2><span>PROTECȚIA DATELOR PERSONALE ȘI POLITICA DE CONFIDENȚIALITATE</span></h2><br><p>Acest text de divulgare a fost pregătit în conformitate cu Legea nr. 6698 privind Protecția Datelor Personale (KVKK) și Regulamentul General privind Protecția Datelor al Uniunii Europene (GDPR). Mai jos, puteți găsi informații despre ce date personale colectăm în timp ce jucați jocul nostru, cum le procesăm și cum le protejăm.</p><br><h4><span class=\"title-square\"></span>1. Cine este Operatorul de Date?</h4><p>Acest joc este operat de xuibo. Dacă doriți să ne contactați în legătură cu protecția datelor dumneavoastră personale, ne puteți contacta la <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>2. Ce Date Personale Procesăm?</h4><p>Nu colectăm direct date de identitate în timp ce jucați jocul nostru. Totuși, putem procesa următoarele date:</p><br><h6><span class=\"title-square\"></span>Date obligatorii (Necesare pentru experiența de joc)</h6><p>Numele jucătorului (Afișat în clasament)<br>Statistici ale jocului (Scor, numărul de răspunsuri corecte/incorecte, etc.)<br>Setări de sunet și vizuale (Stocate folosind LocalStorage în browser)</p><br><h6><span class=\"title-square\"></span>Date colectate automat</h6><p>Adresa IP și informațiile despre dispozitiv (Colectate anonim prin Google Analytics)<br>Informații despre browser și sistemul de operare<br>Date de utilizare legate de performanța jocului (Numărul de întrebări răspunse, durata jocului, etc.)</p><br><h6><span class=\"title-square\"></span>Cookie-uri și Tehnologii de Urmărire</h6><p>Jocul nostru poate utiliza cookie-uri pentru a colecta date anonime prin Google Analytics și instrumente similare. Pentru mai multe detalii, vă rugăm să consultați <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Politica noastră de cookie-uri</a>.</p><br><h4><span class=\"title-square\"></span>3. Scopurile Procesării Datelor Personale</h4><p>Asigurarea funcționării corespunzătoare a jocului<br>Crearea clasamentului și afișarea rangurilor jucătorilor<br>Personalizarea experienței de joc (Dulapirea sunetului, preferințe full-screen, etc.)<br>Analizarea și îmbunătățirea performanței jocului<br>Securitate, depanare și prevenirea fraudelor<br>Respectarea obligațiilor legale</p><br><h4><span class=\"title-square\"></span>4. Cu Cine Împărtășim Datele Personale?</h4><p>Numele jucătorilor și scorurile din clasament pot fi afișate public.<br>Datele anonime sunt analizate prin Google Analytics, dar nu sunt împărtășite date personale.<br>Datele pot fi împărtășite autorităților competente la cereri legale.</p><br><h4><span class=\"title-square\"></span>5. Temeiul Legal pentru Procesarea Datelor Personale</h4><p>Datele dumneavoastră sunt procesate în conformitate cu KVKK și GDPR pe baza următoarelor temeiuri legale:<br><br>Executarea unui contract (Art. 5/2-c din KVKK, Art. 6/1-b din GDPR) → Asigurarea funcționării corespunzătoare a jocului<br>Interes legitim (Art. 5/2-f din KVKK, Art. 6/1-f din GDPR) → Analizarea și îmbunătățirea experienței de joc<br>Obligații legale (Art. 5/2-ç din KVKK, Art. 6/1-c din GDPR) → Răspuns la cererile oficiale din partea autorităților</p><br><h4><span class=\"title-square\"></span>6. Cât Timp Păstrăm Datele Dumneavoastră?</h4><p>Numele jucătorilor și scorurile din clasament pot fi păstrate pe termen nelimitat. Cu toate acestea, jucătorii pot solicita ștergerea datelor lor.<br>Datele Google Analytics sunt anonimizate și șterse automat după o perioadă determinată.<br>Setările browserului local (LocalStorage) sunt păstrate până când browserul este închis sau utilizatorul le șterge manual.</p><br><h4><span class=\"title-square\"></span>7. Drepturile Dumneavoastră Conform KVKK și GDPR</h4><p>Conform KVKK și GDPR, aveți următoarele drepturi:<br><br>- Să aflați dacă datele dumneavoastră sunt procesate<br>- Să înțelegeți scopul procesării și cum sunt utilizate<br>- Să solicitați corectarea dacă datele sunt procesate incorect sau incomplet<br>- Să solicitați ștergerea sau anonimizarea datelor dumneavoastră<br>- Să fiți informat dacă datele procesate sunt împărtășite cu terțe părți<br>- Să solicitați compensații dacă procesarea este ilegală și provoacă daune</p><br><p>Pentru a exercita aceste drepturi, ne puteți contacta la <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a>.</p><br><h4><span class=\"title-square\"></span>8. Drepturi Suplimentare GDPR (Pentru Utilizatorii din UE)</h4><p>- Dreptul la Portabilitatea Datelor: Dacă este solicitat, putem transfera datele dumneavoastră către dumneavoastră sau către alt furnizor de servicii.<br>- Dreptul de a Obiecta la Deciziile Automatizate: Puteți obiecta evaluării datelor dumneavoastră de către sistemele automatizate.<br>- Dreptul de a Retrage Consimțământul: Dacă datele dumneavoastră sunt procesate pe baza consimțământului dumneavoastră, puteți retrage consimțământul în orice moment.</p><br><h4><span class=\"title-square\"></span>9. Politica de Cookie-uri și Opțiuni de Consimțământ</h4><p>Jocul nostru utilizează cookie-uri pentru a îmbunătăți experiența de joc. În conformitate cu legile GDPR aplicabile în Uniunea Europeană, consimțământul dumneavoastră poate fi necesar pentru utilizarea cookie-urilor. Dacă doriți să dezactivați cookie-urile, puteți face acest lucru în setările browserului dumneavoastră.</p><br><p>Pentru mai multe detalii, vă rugăm să vizitați pagina noastră <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">Politica de Cookie-uri</a>.</p><br><h4><span class=\"title-square\"></span>10. Actualizări și Modificări</h4><p>Această politică de confidențialitate poate fi actualizată din când în când. Vă vom notifica despre modificările semnificative prin intermediul site-ului nostru sau în cadrul jocului.</p><br><p>Ultima actualizare: 17.03.2025</p>"
}