{
	"start_game": "شروع کریں",
	"leaderboard": "لیڈربورڈ",
	"how_to_play_title": "کیسے کھیلا جائے؟",
	"contact_title": "رابطہ",
	"game_settings": "گیم کی سیٹنگز",
	"game_difficulty": "مشکل سطح",
	"game_difficulty_normal": "معمولی",
	"game_difficulty_hard": "مشکل",
	"game_number_of_fault": "غلطیوں کی تعداد",
	"game_options_amount": "اختیارات",
	"spent_time": "گزرے وقت",
	"laps_amount": "لپس کی تعداد",
	"play_again": "دوبارہ کھیلیں",
	"save": "محفوظ کریں",
	"send": "بھجیں",
	"save_score": "اسکور محفوظ کریں",
	"score_owner": "اسکور کا مالک",
	"email_address": "ای میل پتہ",
	"message": "آپ کا پیغام",
	"go_back": "واپس جائیں",
	"be_ready": "تیار ہو جائیں",
	"hard": "مشکل",
	"full_screen_mode_title": "فل اسکرین موڈ",
	"full_screen_mode_desc": "بہترین گیم کے تجربے کے لئے تجویز کیا گیا",
	"no_record": "یہاں کوئی ریکارڈ نہیں ہے",
	"global": "عالمی",
	"points": "{points} پوائنٹس",
	"multiplier": "{multiplier} ملٹی پلیئر",
	"lap": "{lap} لپ",
	"game_ended": "گیم ختم ہو گئی",
	"privacy_policy_title": "پرائیویسی پالیسی",
	"cookie_policy_title": "کوکی پالیسی",
	"terms_of_use_title": "استعمال کی شرائط",
	"gdpr_title": "جی ڈی پی آر متن",
	"main_title": "پرچم پہیلی",
	"main_description": "مشکل کی سطح کے ساتھ پرچم دریافت کریں، صحیح جواب منتخب کریں اور لیڈربورڈ پر اپنی جگہ بنائیں! تفریحی اور مقابلہ جاتی پرچم کوئز گیم آپ کا انتظار کر رہا ہے۔",
	"multiplier_title": "ضربی ضریب:",
	"lives_are_over": "آپ کی زندگیاں ختم ہو گئی ہیں",
	"return_the_game": "مختصر اشتہاری وقفے کے ساتھ کھیل میں واپس آئیں!",
	"watch_ad": "اشتہار دیکھیں",
	"end_game": "کھیل ختم کریں",
	"hours": "گھنٹے",
	"minutes": "منٹ",
	"seconds": "سیکنڈ",
	"sound_on": "آواز آن",
	"sound_off": "آواز آف",
	"score_saved_successfully": "اسکور کامیابی سے محفوظ کر لیا گیا",
	"message_sent_successfully": "آپ کا پیغام کامیابی سے بھیج دیا گیا",
	"invalid_owner": "غلط اسکور مالک کی معلومات",
	"invalid_email": "غلط ای میل ایڈریس",
	"occured_an_error": "ایک خرابی ہوئی",
	"how_to_play": "<h4><span class=\"title-square\"></span>گیم کا مقصد:</h4><p>اپنے پرچم کے علم کا امتحان لیں اور سب سے زیادہ اسکور کرنے کی کوشش کریں! جو پرچم آپ گیم میں دیکھیں، ان کا صحیح ملک بتائیں اور اپنی نام کو لیڈربورڈ پر ڈالیں!</p><br><h4><span class=\"title-square\"></span>گیم شروع کرنا:</h4><p>مین مینو سے 'گیم شروع کریں' منتخب کریں۔</p><br><h6><span class=\"title-square\"></span>گیم کی سیٹنگز سیٹ کریں:</h6><p><b>مشکل سطح:</b> معمولی یا مشکل<br><b>غلطیوں کی تعداد:</b> 1، 3، یا 5<br><b>اختیارات کی تعداد:</b> 2، 4، یا 6<br><b>فل اسکرین موڈ:</b> آن یا آف</p><br><h6><span class=\"title-square\"></span>جب گیم شروع ہو:</h6><p>اوپر بائیں: موجودہ اسکور اور ملٹی پلیئر<br>اوپر بیچ میں: 10 سیکنڈ کی گنتی<br>اوپر دائیں: غلطیوں کی تعداد (دل کا آئیکن)<br>ماؤنٹ/آن کریں بٹن</p><br><h4><span class=\"title-square\"></span>اسکورنگ سسٹم:</h4><p>اسکور مختلف ہوتا ہے گیم شروع کرنے کے وقت منتخب کی جانے والی سیٹنگز کے مطابق:</p><br><p><b>مشکل سطح:</b> معمولی (x1.00)، مشکل (x1.50)<br><b>غلطیوں کی تعداد:</b> 1 (x1.50)، 3 (x1.00)، 5 (x0.50)<br><b>اختیارات کی تعداد:</b> 2 (x0.50)، 4 (x1.00)، 6 (x1.50)<br><b>ہر راؤنڈ کا ڈیفالٹ ملٹی پلیئر:</b> x1.00</p><br><h4><span class=\"title-square\"></span>گیم جیتنے کا طریقہ:</h4><p>اگر آپ غلط جواب دیتے ہیں تو آپ کی غلطی کی گنتی کم ہو جائے گی۔<br>اگر وقت ختم ہو جاتا ہے، تو گیم ختم ہو جاتی ہے۔<br>گیم کے اختتام پر، آپ اپنی اسٹیٹسٹکس اور اسکور دیکھ سکتے ہیں۔<br>آپ اپنے اسکور کو محفوظ کر کے لیڈربورڈ میں داخل کر سکتے ہیں۔</p>",
	"cookie_policy": "<h2><span>کوکی پالیسی</span></h2><br><h4><span class=\"title-square\"></span>کوکی کیا ہیں؟</h4><p>یہ گیم صارف کے تجربے کو بہتر بنانے کے لئے کوکیز استعمال کرتا ہے۔ کوکیز چھوٹے ٹیکسٹ فائلز ہیں جو آپ کے ڈیوائس پر محفوظ ہوتی ہیں اور آپ کی گیم سیٹنگز کو یاد رکھنے کے لئے استعمال کی جاتی ہیں۔</p><br><h4><span class=\"title-square\"></span>ہم کون سی کوکیز استعمال کرتے ہیں؟</h4><h6><span class=\"title-square\"></span>ضروری کوکیز:</h6><p>ہم گیم کی آواز کی سیٹنگز کو محفوظ رکھنے کے لیے لوکل اسٹوریج کا استعمال کرتے ہیں۔</p><h6><span class=\"title-square\"></span>اینالٹکس کوکیز:</h6><p>ہم گیم کے کھیلنے کے طریقے اور کون سے حصے زیادہ مقبول ہیں یہ جانچنے کے لیے گوگل اینالٹکس کا استعمال کرتے ہیں۔</p><h6><span class=\"title-square\"></span>اشتہاری کوکیز:</h6><p>اگر ہم گیم میں گوگل ایڈ سینس استعمال کرتے ہیں، تو کوکیز کو گوگل کے ذریعے ذاتی نوعیت کے اشتہارات دکھانے کے لیے استعمال کیا جا سکتا ہے۔</p><br><h4><span class=\"title-square\"></span>کیا میں کوکیز کو غیر فعال کر سکتا ہوں؟</h4><p>آپ اپنے براؤزر کی سیٹنگز سے کوکیز کو حذف یا بلاک کر سکتے ہیں۔ تاہم، کچھ خصوصیات صحیح طریقے سے کام نہیں کر سکتی ہیں۔</p>",
	"privacy_policy": "<h2><span>رازداری کی پالیسی</span></h2><br><h4><span class=\"title-square\"></span>ہم کونسا ڈیٹا جمع کرتے ہیں؟</h4><p>کھلاڑیوں کے نام اور اسکور لیڈر بورڈ میں محفوظ کیے جاتے ہیں۔<br>ہم آپ کی گیم کی ترجیحات (آواز آن/آف وغیرہ) کو آپ کے براؤزر میں محفوظ کرتے ہیں۔<br>ہم Google Analytics کا استعمال کرکے گیم کی کارکردگی کا تجزیہ کرتے ہیں۔</p><br><h4><span class=\"title-square\"></span>ڈیٹا کیسے استعمال کیا جاتا ہے؟</h4><p>کھلاڑی کے تجربے کو بہتر بنانے کے لیے<br>لیڈر بورڈ بنانے کے لیے<br>گیم کی کارکردگی کا تجزیہ کرنے کے لیے</p><br><h4><span class=\"title-square\"></span>کیا ہم ڈیٹا شیئر کرتے ہیں؟</h4><p>آپ کا ذاتی ڈیٹا تیسرے فریق کے ساتھ شیئر نہیں کیا جاتا۔<br>البتہ، چونکہ ہم Google Analytics استعمال کرتے ہیں، اس لیے Google کی اپنی کوکی پالیسی لاگو ہو سکتی ہے۔</p><br><h4><span class=\"title-square\"></span>ڈیٹا کی سیکیورٹی</h4><p>کھلاڑیوں کے نام اور اسکور کے علاوہ کوئی ذاتی ڈیٹا جمع نہیں کیا جاتا۔<br>ڈیٹا کو خفیہ کردہ ڈیٹا بیسز میں محفوظ اور محفوظ کیا جاتا ہے۔</p>",
	"terms_of_use": "<h2><span>استعمال کی شرائط</span></h2><br><h4><span class=\"title-square\"></span>1. سروس کا استعمال</h4><p>یہ گیم سب کے لیے کھلا ہے اور کھیلنے کے لیے مفت ہے۔<br>گیم کھیل کر، آپ یہاں بیان کردہ شرائط سے اتفاق کرتے ہیں۔</p><br><h4><span class=\"title-square\"></span>2. اکاؤنٹ اور اسکور کی رجسٹریشن</h4><p>کھلاڑیوں کو صرف اپنا نام درج کرنا ہوتا ہے تاکہ ان کے اسکور محفوظ کیے جا سکیں۔<br>درج کردہ نام سب کو نظر آئیں گے۔<br>کھلاڑیوں کو گیم کے دوران نامناسب، گالی گلوچ پر مبنی یا غیر قانونی نام استعمال کرنے کی اجازت نہیں ہے۔</p><br><h4><span class=\"title-square\"></span>3. دانشورانہ املاک کے حقوق</h4><p>گیم کا مواد (جھنڈے، گرافکس، میکینکس) کاپی رائٹ کے تابع ہے۔</p><br><h4><span class=\"title-square\"></span>4. سزائیں اور اختتام</h4><p>اگر گیم کا غلط استعمال کیا جائے یا دھوکہ دہی کا پتہ چلے، تو صارفین کے اسکور حذف کیے جا سکتے ہیں۔</p>",
	"gdpr": "<h2><span>ذاتی ڈیٹا کے تحفظ اور رازداری کی پالیسی</span></h2><br><p>یہ وضاحتی متن ذاتی ڈیٹا کے تحفظ کے قانون نمبر 6698 (KVKK) اور یورپی یونین کے جنرل ڈیٹا پروٹیکشن ریگولیشن (GDPR) کے مطابق تیار کیا گیا ہے۔ نیچے، آپ کو یہ معلومات ملیں گی کہ جب آپ ہمارا گیم کھیلتے ہیں تو ہم کون سا ذاتی ڈیٹا اکٹھا کرتے ہیں، اسے کیسے پروسیس کرتے ہیں، اور ہم اسے کیسے محفوظ رکھتے ہیں۔</p><br><h4><span class=\"title-square\"></span>1. ڈیٹا کنٹرولر کون ہے؟</h4><p>یہ گیم xuibo کے ذریعہ چلایا جاتا ہے۔ اگر آپ اپنے ذاتی ڈیٹا کے تحفظ کے بارے میں ہم سے رابطہ کرنا چاہتے ہیں تو آپ ہمیں <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a> پر ای میل کر سکتے ہیں۔</p><br><h4><span class=\"title-square\"></span>2. ہم کون سا ذاتی ڈیٹا پروسیس کرتے ہیں؟</h4><p>ہم براہ راست آپ کی شناخت سے متعلق ڈیٹا اکٹھا نہیں کرتے، لیکن درج ذیل ڈیٹا پروسیس کر سکتے ہیں:</p><br><h6><span class=\"title-square\"></span>لازمی ڈیٹا (گیم کے تجربے کے لیے ضروری)</h6><p>کھلاڑی کا نام (لیڈر بورڈ پر ظاہر ہوگا)<br>گیم کے اعداد و شمار (اسکور، درست/غلط جوابات کی تعداد وغیرہ)<br>آواز اور بصری ترتیبات (براؤزر میں LocalStorage کے ذریعے محفوظ کی جاتی ہیں)</p><br><h6><span class=\"title-square\"></span>خودکار طریقے سے اکٹھا کیا گیا ڈیٹا</h6><p>IP ایڈریس اور ڈیوائس کی معلومات (Google Analytics کے ذریعے گمنام طور پر اکٹھی کی جاتی ہیں)<br>براؤزر اور آپریٹنگ سسٹم کی معلومات<br>گیم کے استعمال سے متعلق ڈیٹا (سوالات کی تعداد، گیم کا دورانیہ وغیرہ)</p><br><h6><span class=\"title-square\"></span>کوکیز اور ٹریکنگ ٹیکنالوجیز</h6><p>ہمارا گیم Google Analytics اور اسی طرح کے ٹولز کے ذریعے گمنام ڈیٹا اکٹھا کرنے کے لیے کوکیز استعمال کر سکتا ہے۔ مزید تفصیلات کے لیے براہ کرم ہماری <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">کوکی پالیسی</a> ملاحظہ کریں۔</p><br><h4><span class=\"title-square\"></span>3. ذاتی ڈیٹا کو پروسیس کرنے کے مقاصد</h4><p>گیم کو درست طریقے سے چلانے کو یقینی بنانا<br>لیڈر بورڈ بنانا اور کھلاڑیوں کی درجہ بندی ظاہر کرنا<br>گیم کے اندرونی تجربے کو ذاتی بنانا (آواز بند کرنا، فل سکرین ترجیح وغیرہ)<br>گیم کی کارکردگی کا تجزیہ اور بہتری<br>سیکیورٹی، ڈیبگنگ، اور دھوکہ دہی کی روک تھام<br>قانونی ذمہ داریوں کی تعمیل</p><br><h4><span class=\"title-square\"></span>4. ہم ذاتی ڈیٹا کس کے ساتھ شیئر کرتے ہیں؟</h4><p>لیڈر بورڈ پر کھلاڑیوں کے نام اور اسکور عوامی طور پر دکھائے جا سکتے ہیں۔<br>گمنام ڈیٹا Google Analytics کے ذریعے تجزیہ کیا جاتا ہے، لیکن کوئی ذاتی ڈیٹا شیئر نہیں کیا جاتا۔<br>قانونی درخواستوں پر مجاز حکام کے ساتھ ڈیٹا شیئر کیا جا سکتا ہے۔</p><br><h4><span class=\"title-square\"></span>5. ذاتی ڈیٹا پروسیسنگ کے لیے قانونی بنیاد</h4><p>آپ کا ڈیٹا KVKK اور GDPR کے مطابق درج ذیل قانونی بنیادوں پر پروسیس کیا جاتا ہے:<br><br>معاہدے کی کارکردگی (KVKK آرٹیکل 5/2-c، GDPR آرٹیکل 6/1-b) → گیم کو صحیح طریقے سے چلانے کو یقینی بنانا<br>جائز مفاد (KVKK آرٹیکل 5/2-f، GDPR آرٹیکل 6/1-f) → گیم کے تجربے کا تجزیہ اور بہتری<br>قانونی ذمہ داریاں (KVKK آرٹیکل 5/2-ç، GDPR آرٹیکل 6/1-c) → حکام کی سرکاری درخواستوں کا جواب دینا</p><br><h4><span class=\"title-square\"></span>6. ہم آپ کا ڈیٹا کب تک محفوظ رکھتے ہیں؟</h4><p>لیڈر بورڈ میں کھلاڑیوں کے نام اور اسکور غیر معینہ مدت تک محفوظ رہ سکتے ہیں۔ تاہم، کھلاڑی اپنے ڈیٹا کو حذف کرنے کی درخواست کر سکتے ہیں۔<br>Google Analytics کا ڈیٹا گمنام کیا جاتا ہے اور ایک مقررہ مدت کے بعد خود بخود حذف ہو جاتا ہے۔<br>مقامی براؤزر کی ترتیبات (LocalStorage) اس وقت تک محفوظ رہتی ہیں جب تک کہ براؤزر بند نہ ہو جائے یا صارف انہیں دستی طور پر صاف نہ کرے۔</p><br><h4><span class=\"title-square\"></span>7. KVKK اور GDPR کے تحت آپ کے حقوق</h4><p>KVKK اور GDPR کے تحت، آپ کو درج ذیل حقوق حاصل ہیں:<br><br>- یہ جاننے کا حق کہ آیا آپ کا ڈیٹا پروسیس ہو رہا ہے<br>- پروسیسنگ کے مقصد اور اس کے استعمال کو سمجھنے کا حق<br>- اگر ڈیٹا غلط یا نامکمل ہے تو اسے درست کرنے کی درخواست کرنے کا حق<br>- اپنے ڈیٹا کو حذف یا گمنام بنانے کی درخواست کرنے کا حق<br>- اگر آپ کا پروسیس شدہ ڈیٹا تیسرے فریق کے ساتھ شیئر کیا گیا ہو تو مطلع کیے جانے کا حق<br>- اگر پروسیسنگ غیر قانونی ہے اور نقصان پہنچا ہے تو معاوضہ طلب کرنے کا حق</p><br><p>ان حقوق کو استعمال کرنے کے لیے، آپ ہم سے <a href=\"mailto:info@xuibo.com\">info@xuibo.com</a> پر رابطہ کر سکتے ہیں۔</p><br><h4><span class=\"title-square\"></span>8. اضافی GDPR حقوق (EU صارفین کے لیے)</h4><p>- ڈیٹا پورٹیبلٹی کا حق: اگر درخواست کی جائے تو ہم آپ کا ڈیٹا آپ کو یا کسی دوسرے سروس فراہم کنندہ کو منتقل کر سکتے ہیں۔<br>- خودکار فیصلہ سازی پر اعتراض کرنے کا حق: آپ اپنے ڈیٹا کے خودکار سسٹمز کے ذریعہ تجزیہ پر اعتراض کر سکتے ہیں۔<br>- رضامندی واپس لینے کا حق: اگر آپ کا ڈیٹا آپ کی رضامندی کی بنیاد پر پروسیس کیا جا رہا ہے، تو آپ کسی بھی وقت اپنی رضامندی واپس لے سکتے ہیں۔</p><br><h4><span class=\"title-square\"></span>9. کوکی پالیسی اور رضامندی کے اختیارات</h4><p>ہمارا گیم گیمنگ کے تجربے کو بہتر بنانے کے لیے کوکیز استعمال کرتا ہے۔ یورپی یونین میں لاگو GDPR قوانین کے مطابق، کوکیز کے استعمال کے لیے آپ کی رضامندی درکار ہو سکتی ہے۔ اگر آپ کوکیز کو غیر فعال کرنا چاہتے ہیں، تو آپ اپنے براؤزر کی ترتیبات میں جا سکتے ہیں۔</p><br><p>مزید تفصیلات کے لیے براہ کرم ہماری <a href=\"${SERVER}${LANG}/cookie-policy\" target=\"_blank\">کوکی پالیسی</a> ملاحظہ کریں۔</p><br><h4><span class=\"title-square\"></span>10. اپڈیٹس اور تبدیلیاں</h4><p>یہ رازداری کی پالیسی وقتاً فوقتاً اپ ڈیٹ کی جا سکتی ہے۔ ہم آپ کو اپنی ویب سائٹ یا گیم کے اندر اہم تبدیلیوں کے بارے میں مطلع کریں گے۔</p><br><p>آخری اپڈیٹ: 17.03.2025</p>"
}